{
    "11213": {
        "name_en": "HTTP TRACE / TRACK Methods Allowed",
        "name_cn": "HTTP TRACE / TRAC方法未禁用",
        "risk_en": "Medium",
        "risk_cn": "中危",
        "describe_en": "The remote web server supports the TRACE and/or TRACK methods. TRACE and TRACK are HTTP methods that are used to debug web server connections.",
        "describe_cn": "主机支持TRACE和/或TRACK方法。 TRACE和TRACK是HTTP用来调试web服务器连接的方法。",
        "solution_en": "Disable these HTTP methods. Refer to the plugin output for more information.",
        "solution_cn": "禁用TRACE / TRAC方法，参考如下： 1、IIS下：IIS信息服务－web服务扩展：禁止\"WebDAV； 2、apache下：修改httpd.conf配置文件中\"TraceEnable on\"为\"TraceEnable off\"",
        "cve": "",
        "plugin_id": "11213"
    },
    "11658": {
        "name_en": "Sun ONE Application Server Upper Case Request JSP Source Disclosure",
        "name_cn": "Sun ONE Application Server源泄露漏洞",
        "risk_en": "Medium",
        "risk_cn": "中危",
        "describe_en": "It is possible to make the remote web server disclose the source code of its JSP pages by requesting the pages with a different case (ie: filename.JSP instead of filename.jsp). An attacker may use this flaw to get the source code of your CGIs and possibly obtain passwords and other relevant information about this host.",
        "describe_cn": "Windows 2000/XP平台下的Sun ONE Application Server 7.0存在漏洞。远程攻击者可以借助一个用大写“.JSP”扩展名代替小写.jsp的请求获得JSP源代码。",
        "solution_en": "Upgrade to Sun ONE Application Server 7.0 Update Release 1.",
        "solution_cn": "补丁下载地址如下： http://wwws.sun.com/software/download/app_servers.html",
        "cve": "",
        "plugin_id": "11658"
    },
    "34460": {
        "name_en": "Unsupported Web Server Detection",
        "name_cn": "当前Web Server版本厂商已不再支持",
        "risk_en": "High",
        "risk_cn": "高危",
        "describe_en": "According to its version, the remote web server is obsolete and no longer maintained by its vendor or provider. Lack of support implies that no new security patches for the product will be released by the vendor. As a result, it may contain security vulnerabilities.",
        "describe_cn": "根据现有版本，远程主机web服务已不在厂商支持范围内，缺少厂商的支持，意味着没有新的安全补丁包发布，结果主机存在多个安全威胁。",
        "solution_en": "Remove the web server if it is no longer needed. Otherwise, upgrade to a supported version if possible or switch to another server.",
        "solution_cn": "如果不需要此项服务，关闭它。如果可能，升级新的版本，或更换其它的Web服务器。",
        "cve": "",
        "plugin_id": "34460"
    },
    "20007": {
        "name_en": "SSL Version 2 (v2) Protocol Detection",
        "name_cn": "SSL 2.0协议未禁用",
        "risk_en": "High",
        "risk_cn": "高危",
        "describe_en": "The remote service accepts connections encrypted using SSL 2.0 and/or SSL 3.0. These versions of SSL are affected by several cryptographic flaws, including: - An insecure padding scheme with CBC ciphers. - Insecure session renegotiation and resumption schemes. An attacker can exploit these flaws to conduct man-in-the-middle attacks or to decrypt communications between the affected service and clients. Although SSL/TLS has a secure means for choosing the highest supported version of the protocol (so that these versions will be used only if the client or server support nothing better), many web browsers implement this in an unsafe way that allows an attacker to downgrade a connection (such as in POODLE). Therefore, it is recommended that these protocols be disabled entirely. NIST has determined that SSL 3.0 is no longer acceptable for secure communications. As of the date of enforcement found in PCI DSS v3.1, any version of SSL will not meet the PCI SSC's definition of 'strong cryptography'.",
        "describe_cn": "远程服务使用SSL 2.0进行通信连接加密，根据公开的漏洞曝露报告，此版本的协议存在一些加密缺陷，并已废弃多年。攻击者可以利用这个漏洞发动中间人攻击或解密受此影响的客户端之间的通信内容。",
        "solution_en": "Consult the application's documentation to disable SSL 2.0 and 3.0. Use TLS 1.2 (with approved cipher suites) or higher instead.",
        "solution_cn": "禁用SSL 2.0，使用TLS 1.0或更高版本代替",
        "cve": "",
        "plugin_id": "20007"
    },
    "35291": {
        "name_en": "SSL Certificate Signed using Weak Hashing Algorithm",
        "name_cn": "SSL证书签名使用弱强度的哈希算法",
        "risk_en": "Medium",
        "risk_cn": "中危",
        "describe_en": "The remote service uses an SSL certificate chain that has been signed using a cryptographically weak hashing algorithm (e.g. MD2, MD4, MD5, or SHA1). These signature algorithms are known to be vulnerable to collision attacks. An attacker can exploit this to generate another certificate with the same digital signature, allowing an attacker to masquerade as the affected service. Note that this plugin reports all SSL certificate chains signed with SHA-1 that expire after January 1, 2017 as vulnerable. This is in accordance with Google's gradual sunsetting of the SHA-1 cryptographic hash algorithm. Note that certificates in the chain that are contained in the Nessus CA database (known_CA.inc) have been ignored.",
        "describe_cn": "远程服务器的SSL证书签名使用弱强度的哈希加密算法，例如MD2、MD4或者MD5。这些签名算法显示容易遭到破解。",
        "solution_en": "Contact the Certificate Authority to have the SSL certificate reissued.",
        "solution_cn": "联系证书认证机构发布新的证书。 如果服务器使用自签名证书，则可自己",
        "cve": "",
        "plugin_id": "35291"
    },
    "42873": {
        "name_en": "SSL Medium Strength Cipher Suites Supported",
        "name_cn": "允许SSL采用中强度加密",
        "risk_en": "Medium",
        "risk_cn": "中危",
        "describe_en": "The remote host supports the use of SSL ciphers that offer medium strength encryption. Nessus regards medium strength as any encryption that uses key lengths at least 64 bits and less than 112 bits, or else that uses the 3DES encryption suite. Note that it is considerably easier to circumvent medium strength encryption if the attacker is on the same physical network.",
        "describe_cn": "远程主机支持SSL使用的密码采用中强度解密，即使用的KEY解密长度至少64位，但少于112位。注意：如果攻击者在同一个物理网段，密码很容易暴露。",
        "solution_en": "Reconfigure the affected application if possible to avoid use of medium strength ciphers.",
        "solution_cn": "重新设置受影响的应用程序，可能的话，避免使用中强度加密，改为强度较高的加密算法。",
        "cve": "",
        "plugin_id": "42873"
    },
    "45411": {
        "name_en": "SSL Certificate with Wrong Hostname",
        "name_cn": "SSL证书主机名不匹配",
        "risk_en": "Medium",
        "risk_cn": "中危",
        "describe_en": "The 'commonName' (CN) attribute of the SSL certificate presented for this service is for a different machine.",
        "describe_cn": "SSL现有认证的commonName (CN)是供其它主机使用的。",
        "solution_en": "Purchase or generate a proper SSL certificate for this service.",
        "solution_cn": "为此项服务购买或生产一个合适的证书",
        "cve": "",
        "plugin_id": "45411"
    },
    "51192": {
        "name_en": "SSL Certificate Cannot Be Trusted",
        "name_cn": "SSL证书不被信任",
        "risk_en": "Medium",
        "risk_cn": "中危",
        "describe_en": "The server's X.509 certificate cannot be trusted. This situation can occur in three different ways, in which the chain of trust can be broken, as stated below : - First, the top of the certificate chain sent by the server might not be descended from a known public certificate authority. This can occur either when the top of the chain is an unrecognized, self-signed certificate, or when intermediate certificates are missing that would connect the top of the certificate chain to a known public certificate authority. - Second, the certificate chain may contain a certificate that is not valid at the time of the scan. This can occur either when the scan occurs before one of the certificate's 'notBefore' dates, or after one of the certificate's 'notAfter' dates. - Third, the certificate chain may contain a signature that either didn't match the certificate's information or could not be verified. Bad signatures can be fixed by getting the certificate with the bad signature to be re-signed by its issuer. Signatures that could not be verified are the result of the certificate's issuer using a signing algorithm that Nessus either does not support or does not recognize. If the remote host is a public host in production, any break in the chain makes it more difficult for users to verify the authenticity and identity of the web server. This could make it easier to carry out man-in-the-middle attacks against the remote host.",
        "describe_cn": "此项服务的SSL证书不被信任。",
        "solution_en": "Purchase or generate a proper SSL certificate for this service.",
        "solution_cn": "为此项服务购买或生成合适的证书",
        "cve": "",
        "plugin_id": "51192"
    },
    "57582": {
        "name_en": "SSL Self-Signed Certificate",
        "name_cn": "SSL自签名证书",
        "risk_en": "Medium",
        "risk_cn": "中危",
        "describe_en": "The X.509 certificate chain for this service is not signed by a recognized certificate authority. If the remote host is a public host in production, this nullifies the use of SSL as anyone could establish a man-in-the-middle attack against the remote host. Note that this plugin does not check for certificate chains that end in a certificate that is not self-signed, but is signed by an unrecognized certificate authority.",
        "describe_cn": "服务器所使用的X.509签署的证书链不是权威的证书颁发机构所颁发的。这削弱了使用SSL的效果，因为任何人都可以建立一个中间人攻击远程主机。",
        "solution_en": "Purchase or generate a proper SSL certificate for this service.",
        "solution_cn": "购买或者生成被认可的证书",
        "cve": "",
        "plugin_id": "57582"
    },
    "57608": {
        "name_en": "SMB Signing Required",
        "name_cn": "SMB数字签名通信禁用",
        "risk_en": "Medium",
        "risk_cn": "中危",
        "describe_en": "Signing is not required on the remote SMB server. An unauthenticated, remote attacker can exploit this to conduct man-in-the-middle attacks against the SMB server.",
        "describe_cn": "SMB 协议为 Microsoft 文件和打印共享以及许多其他网络操作（例如远程 Windows 管理）提供基础。为了防止在传输过程中修改 SMB 数据包的拦截攻击，SMB 协议支持对 SMB 数据包的数字签名。 主机禁用了SMB数字签名通信，这可能导致潜在攻击者针对SMB通信服务进行中间人攻击。",
        "solution_en": "Enforce message signing in the host's configuration. On Windows, this is found in the policy setting 'Microsoft network server: Digitally sign communications (always)'. On Samba, the setting is called 'server signing'. See the 'see also' links for further details.",
        "solution_cn": "在本地策略中--安全选项设置如下： Microsoft 网络客户端：对通信进行数字签名（若服务器同意）（启用） Microsoft 网络服务器：对通信进行数字签名（若客户同意）（启用）",
        "cve": "",
        "plugin_id": "57608"
    },
    "65821": {
        "name_en": "SSL RC4 Cipher Suites Supported",
        "name_cn": "远程主机支持SSL RC4加密套件",
        "risk_en": "Medium",
        "risk_cn": "中危",
        "describe_en": "The remote host supports the use of RC4 in one or more cipher suites. The RC4 cipher is flawed in its generation of a pseudo-random stream of bytes so that a wide variety of small biases are introduced into the stream, decreasing its randomness. If plaintext is repeatedly encrypted (e.g., HTTP cookies), and an attacker is able to obtain many (i.e., tens of millions) ciphertexts, the attacker may be able to derive the plaintext.",
        "describe_cn": "远程主机在一个或多个支持使用RC4密码套件，RC4密码是有缺陷的生成伪随机流的字节数, 如果明文重复加密(如HTTP cookie),攻击者能够获得许多(即数以百万计)明文密文配对,攻击者可以获得密文后，对比获得明文。",
        "solution_en": "Reconfigure the affected application, if possible, to avoid use of RC4 ciphers. Consider using TLS 1.2 with AES-GCM suites subject to browser and web server support.",
        "solution_cn": "重新设置受影响的应用程序，可能的话，避免使用RC4密钥算法，可以考虑给浏览器或WEB服务支持的带有AES-GCM 的TLS 1.2，相关链接： http://www.nessus.org/u?217a3666 http://cr.yp.to/talks/2013.03.12/slides.pdf http://www.isg.rhul.ac.uk/tls/ http://www.imperva.com/docs/HII_Attacking_SSL_when_using_RC4.pdf",
        "cve": "",
        "plugin_id": "65821"
    },
    "69551": {
        "name_en": "SSL Certificate Chain Contains RSA Keys Less Than 2048 bits",
        "name_cn": "SSL证书链包含小于2048位的RSA密钥",
        "risk_en": "Low",
        "risk_cn": "低危",
        "describe_en": "At least one of the X.509 certificates sent by the remote host has a key that is shorter than 2048 bits. According to industry standards set by the Certification Authority/Browser (CA/B) Forum, certificates issued after January 1, 2014 must be at least 2048 bits. Some browser SSL implementations may reject keys less than 2048 bits after January 1, 2014. Additionally, some SSL certificate vendors may revoke certificates less than 2048 bits before January 1, 2014. Note that Nessus will not flag root certificates with RSA keys less than 2048 bits if they were issued prior to December 31, 2010, as the standard considers them exempt.",
        "describe_cn": "远程主机发送的X.509证书中至少有一个具有短于2048位的密钥。根据证书颁发机构/浏览器（CA/B）论坛制定的行业标准，2014年1月1日之后颁发的证书必须至少为2048位。一些浏览器SSL实现可能会在2014年1月1日之后拒绝小于2048位的密钥。此外，一些SSL证书供应商可能会在2014年1月1日之前吊销小于2048位的证书。请注意，如果在2010年12月31日之前颁发RSA密钥小于2048位的根证书，Nessus将不会标记这些根证书，因为标准认为它们是免税的。",
        "solution_en": "Replace the certificate in the chain with the RSA key less than 2048 bits in length with a longer key, and reissue any certificates signed by the old certificate.",
        "solution_cn": "用长度小于2048位的RSA密钥替换链中的证书，然后重新颁发由旧证书签名的所有证书。",
        "cve": "",
        "plugin_id": "69551"
    },
    "73756": {
        "name_en": "Microsoft SQL Server Unsupported Version Detection (remote check)",
        "name_cn": "Microsoft SQL Server不支持的版本检测（远程检查）",
        "risk_en": "Critical",
        "risk_cn": "紧急",
        "describe_en": "According to its self-reported version number, the installation of Microsoft SQL Server on the remote host is no longer supported. Lack of support implies that no new security patches for the product will be released by the vendor. As a result, it is likely to contain security vulnerabilities.",
        "describe_cn": "根据其自我报告的版本号，不再支持在远程主机上安装Microsoft SQL Server。缺少支持意味着供应商不会发布产品的新安全修补程序。因此，它很可能包含安全漏洞。",
        "solution_en": "Upgrade to a version of Microsoft SQL Server that is currently supported.",
        "solution_cn": "升级到当前支持的Microsoft SQL Server版本。",
        "cve": ""
    },
    "78479": {
        "name_en": "SSLv3 Padding Oracle On Downgraded Legacy Encryption Vulnerability (POODLE)",
        "name_cn": "SSLv3 POODLE 安全漏洞",
        "risk_en": "Medium",
        "risk_cn": "中危",
        "describe_en": "The remote host is affected by a man-in-the-middle (MitM) information disclosure vulnerability known as POODLE. The vulnerability is due to the way SSL 3.0 handles padding bytes when decrypting messages encrypted using block ciphers in cipher block chaining (CBC) mode. MitM attackers can decrypt a selected byte of a cipher text in as few as 256 tries if they are able to force a victim application to repeatedly send the same data over newly created SSL 3.0 connections. As long as a client and service both support SSLv3, a connection can be 'rolled back' to SSLv3, even if TLSv1 or newer is supported by the client and service. The TLS Fallback SCSV mechanism prevents 'version rollback' attacks without impacting legacy clients; however, it can only protect connections when the client and service support the mechanism. Sites that cannot disable SSLv3 immediately should enable this mechanism. This is a vulnerability in the SSLv3 specification, not in any particular SSL implementation. Disabling SSLv3 is the only way to completely mitigate the vulnerability.",
        "describe_cn": "支持SSLv3 协议的网站存在被中间人攻击的风险，“Poodle”攻击（全称为Padding Oracle On Downloaded Legacy Encryption）可以提取出SSL连接中的加密数据相应的明文信息。攻击者可以利用这个漏洞发动中间人攻击或解密受此影响的客户端之间的通信内容。",
        "solution_en": "Disable SSLv3. Services that must support SSLv3 should enable the TLS Fallback SCSV mechanism until SSLv3 can be disabled.",
        "solution_cn": "禁用SSL 3.0",
        "cve": "",
        "plugin_id": "78479"
    },
    "104743": {
        "name_en": "TLS Version 1.0 Protocol Detection",
        "name_cn": "TLS版本1.0协议检测",
        "risk_en": "Medium",
        "risk_cn": "中危",
        "describe_en": "The remote service accepts connections encrypted using TLS 1.0. TLS 1.0 has a number of cryptographic design flaws. Modern implementations of TLS 1.0 mitigate these problems, but newer versions of TLS like 1.2 and 1.3 are designed against these flaws and should be used whenever possible. As of March 31, 2020, Endpoints that arenât enabled for TLS 1.2 and higher will no longer function properly with major web browsers and major vendors. PCI DSS v3.2 requires that TLS 1.0 be disabled entirely by June 30, 2018, except for POS POI terminals (and the SSL/TLS termination points to which they connect) that can be verified as not being susceptible to any known exploits.",
        "describe_cn": "远程服务接受使用TLS 1.0加密的连接。TLS 1.0有许多密码设计缺陷。TLS 1.0的现代实现减轻了这些问题，但是像1.2和1.3这样的TLS的新版本是针对这些缺陷而设计的，应该尽可能使用。截至2020年3月31日，为TLS 1.2及更高版本启用的终结点将不再与主要web浏览器和主要供应商正常工作。PCI DSS v3.2要求在2018年6月30日之前完全禁用TLS 1.0，但POS POI终端（及其连接的SSL/TLS终端点）除外，这些终端可以被验证为不易受任何已知漏洞攻击。",
        "solution_en": "Enable support for TLS 1.2 and 1.3, and disable support for TLS 1.0.",
        "solution_cn": "启用对TLS 1.2和1.3的支持，并禁用对TLS 1.0的支持。",
        "cve": "",
        "plugin_id": "104743"
    },
    "18405": {
        "name_en": "Microsoft Windows Remote Desktop Protocol Server Man-in-the-Middle Weakness",
        "name_cn": "微软Windows远程桌面协议服务器中间人攻击漏洞",
        "risk_en": "Medium",
        "risk_cn": "中危",
        "describe_en": "The remote version of the Remote Desktop Protocol Server (Terminal Service) is vulnerable to a man-in-the-middle (MiTM) attack. The RDP client makes no effort to validate the identity of the server when setting up encryption. An attacker with the ability to intercept traffic from the RDP server can establish encryption with the client and server without being detected. A MiTM attack of this nature would allow the attacker to obtain any sensitive information transmitted, including authentication credentials. This flaw exists because the RDP server stores a hard-coded RSA private key in the mstlsapi.dll library. Any local user with access to this file (on any Windows system) can retrieve the key and use it for this attack.",
        "describe_cn": "Microsoft Windows远程桌面协议的实现在处理密钥的交换时存在漏洞，远程攻击者可能利用此漏洞窃取服务器的加密密钥。 起因是尽管通过网络传输的信息已经过加密，但在建立会话的加密密钥时没有核实服务器的身份，导致攻击者可以获得密钥，计算出有效的签名，然后发动中间人攻击。成功利用这个漏洞的攻击者可以完全控制连接在服务器上的客户端。",
        "solution_en": "- Force the use of SSL as a transport layer for this service if supported, or/and - Select the 'Allow connections only from computers running Remote Desktop with Network Level Authentication' setting if it is available.",
        "solution_cn": "[1]如果支持的话，RDP使用SSL作为传输层 [2]“只允许使用网络级身份验证的电脑运行远程桌面建立连接”设置为启用",
        "cve": "",
        "plugin_id": "18405"
    },
    "30218": {
        "name_en": "Terminal Services Encryption Level is not FIPS-140 Compliant",
        "name_cn": "终端服务加密级别不符合FIPS-140",
        "risk_en": "Low",
        "risk_cn": "低危",
        "describe_en": "The encryption setting used by the remote Terminal Services service is not FIPS-140 compliant.",
        "describe_cn": "远程终端服务使用的加密设置不符合FIPS-140。",
        "solution_en": "Change RDP encryption level to : 4. FIPS Compliant",
        "solution_cn": "将RDP加密级别更改为：4.FIPS兼容",
        "cve": "",
        "plugin_id": "30218"
    },
    "57690": {
        "name_en": "Terminal Services Encryption Level is Medium or Low",
        "name_cn": "终端服务加密级别是中等或低",
        "risk_en": "Medium",
        "risk_cn": "中危",
        "describe_en": "The remote Terminal Services service is not configured to use strong cryptography. Using weak cryptography with this service may allow an attacker to eavesdrop on the communications more easily and obtain screenshots and/or keystrokes.",
        "describe_cn": "远程终端服务加密级别不够强，会降低攻击者窃听通信（包含获取截图和键盘记录）的难度。",
        "solution_en": "Change RDP encryption level to one of : 3. High 4. FIPS Compliant",
        "solution_cn": "组策略--计算机配置--管理模板--远程桌面服务--设置客户端连接加密级别： 修改RDP加密级别为“高”或者“FIPS兼容”",
        "cve": "",
        "plugin_id": "57690"
    },
    "58453": {
        "name_en": "Terminal Services Doesn't Use Network Level Authentication",
        "name_cn": "终端服务未使用网络级别身份验证(NLA)",
        "risk_en": "Medium",
        "risk_cn": "中危",
        "describe_en": "The remote Terminal Services is not configured to use Network Level Authentication (NLA) only. NLA uses the Credential Security Support Provider (CredSSP) protocol to perform strong server authentication either through TLS/SSL or Kerberos mechanisms, which protect against man-in-the-middle attacks. In addition to improving authentication, NLA also helps protect the remote computer from malicious users and software by completing user authentication before a full RDP connection is established.",
        "describe_cn": "远程终端服务未配置采用网络级别身份验证(NLA)。NLA使用凭据安全支持提供者(CredSSP)协议通过TLS/ SSL或Kerberos机制来执行强大的服务器身份验证，这能有效防止中间人攻击。除了优化认证,NLA也有助于防止恶意用户在一个完整的RDP连接建立之前，完成用户身份验证。",
        "solution_en": "Enable Network Level Authentication (NLA) on the remote RDP server. This is generally done on the 'Remote' tab of the 'System' settings on Windows.",
        "solution_cn": "在“系统”设置的“远程”选项卡-- 启用网络级身份验证(NLA) 注意：如果客户端不支持“网络级身份验证”，将无法连接服务器远程管理服务。远程管理客户端版本需大于等于6.0",
        "cve": "",
        "plugin_id": "58453"
    },
    "79638": {
        "name_en": "MS14-066: Vulnerability in Schannel Could Allow Remote Code Execution (2992611) (uncredentialed check)",
        "name_cn": "MS14-066：Schannel 远程代码执行漏洞",
        "risk_en": "Critical",
        "risk_cn": "紧急",
        "describe_en": "The remote Windows host is affected by a remote code execution vulnerability due to improper processing of packets by the Secure Channel (Schannel) security package. An attacker can exploit this issue by sending specially crafted packets to a Windows server. Note that this plugin sends a client Certificate TLS handshake message followed by a CertificateVerify message. Some Windows hosts will close the connection upon receiving a client certificate for which it did not ask for with a CertificateRequest message. In this case, the plugin cannot proceed to detect the vulnerability as the CertificateVerify message cannot be sent.",
        "describe_cn": "MS14-066 (CVE-2014-6321) 是存在于Microsoft的schannel.dll中的TLS堆缓冲区溢出漏洞。",
        "solution_en": "Microsoft has released a set of patches for Windows 2003, Vista, 2008, 7, 2008 R2, 8, 2012, 8.1, and 2012 R2.",
        "solution_cn": "目前厂商已经发布了升级补丁以修复此安全问题，补丁获取链接： https://technet.microsoft.com/library/security/ms14-066",
        "cve": "",
        "plugin_id": "79638"
    },
    "90510": {
        "name_en": "MS16-047: Security Update for SAM and LSAD Remote Protocols (3148527) (Badlock) (uncredentialed check)",
        "name_cn": "Windows SAM 和 LSAD 降级漏洞",
        "risk_en": "Medium",
        "risk_cn": "中危",
        "describe_en": "The remote Windows host is affected by an elevation of privilege vulnerability in the Security Account Manager (SAM) and Local Security Authority (Domain Policy) (LSAD) protocols due to improper authentication level negotiation over Remote Procedure Call (RPC) channels. A man-in-the-middle attacker able to intercept communications between a client and a server hosting a SAM database can exploit this to force the authentication level to downgrade, allowing the attacker to impersonate an authenticated user and access the SAM database.",
        "describe_cn": "当安全帐户管理器 (SAM) 和本地安全机构（域策略）(LSAD) 远程协议接受不充分保护它们的验证级别时，它们中会存在一个特权提升漏洞。此漏洞是由 SAM 和 LSAD 远程协议建立远程过程调用 (RPC) 通道的方式导致的。成功利用此漏洞的攻击者可以获得对 SAM 数据库的访问权限。",
        "solution_en": "Microsoft has released a set of patches for Windows Vista, 2008, 7, 2008 R2, 2012, 8.1, RT 8.1, 2012 R2, and 10.",
        "solution_cn": "请选择合适的版本的补丁进行Windows 更新https://technet.microsoft.com/zh-cn/library/security/ms16-047.aspx#ID0EPOAC",
        "cve": "",
        "plugin_id": "90510"
    },
    "136929": {
        "name_en": "JQuery 1.2 < 3.5.0 Multiple XSS",
        "name_cn": "JQuery 1.2<3.5.0多个XSS",
        "risk_en": "Medium",
        "risk_cn": "中危",
        "describe_en": "According to the self-reported version in the script, the version of JQuery hosted on the remote web server is greater than or equal to 1.2 and prior to 3.5.0. It is, therefore, affected by multiple cross site scripting vulnerabilities. Note, the vulnerabilities referenced in this plugin have no security impact on PAN-OS, and/or the scenarios required for successful exploitation do not exist on devices running a PAN-OS release.",
        "describe_cn": "根据脚本中自我报告的版本，远程web服务器上托管的JQuery版本大于或等于1.2且早于3.5.0。因此，它受到多个跨站点脚本漏洞的影响。注意，此插件中引用的漏洞对PAN-OS没有安全影响，并且/或者运行PAN-OS版本的设备上不存在成功利用漏洞所需的场景。",
        "solution_en": "Upgrade to JQuery version 3.5.0 or later.",
        "solution_cn": "升级到JQuery 3.5.0或更高版本。",
        "cve": "CVE-2020-11022",
        "plugin_id": "136929"
    },
    "55786": {
        "name_en": "Oracle Database Unsupported",
        "name_cn": "当前ORACLE数据库版本厂商已不支持",
        "risk_en": "Critical",
        "risk_cn": "紧急",
        "describe_en": "According to its version, the installation of Oracle Database running on the remote host is no longer supported. Lack of support implies that no new security patches for the product will be released by the vendor. As a result, it is likely to contain security vulnerabilities.",
        "describe_cn": "根据远程主机安装的数据库版本，厂家已不再支持，将会缺少安全补丁包，因此，可能存在安全威胁。",
        "solution_en": "Upgrade to a version of Oracle Database that is currently supported.",
        "solution_cn": "升级数据库版本至当前最新版本，至少升级至厂家支持的版本。",
        "cve": "",
        "plugin_id": "55786"
    },
    "69552": {
        "name_en": "Oracle TNS Listener Remote Poisoning",
        "name_cn": "Oracle TNS侦听器远程毒化",
        "risk_en": "High",
        "risk_cn": "高危",
        "describe_en": "The remote Oracle TNS listener allows service registration from a remote host. An attacker can exploit this issue to divert data from a legitimate database server or client to an attacker-specified system. Successful exploits will allow the attacker to manipulate database instances, potentially facilitating man-in-the-middle, session- hijacking, or denial of service attacks on a legitimate database server.",
        "describe_cn": "Oracle Database Server是一个对象关系数据库管理系统。 Oracle Database Server在实现上存在可允许攻击者向远程“TNS Listener”组件处理的数据投毒的漏洞。攻击者可利用此漏洞将数据库服务器的合法“TNS Listener”组件中的数据转向到攻击者控制的系统，导致控制远程组件的数据库实例，造成组件和合法数据库之间的攻击者攻击、会话劫持或拒绝服务攻击。",
        "solution_en": "Apply the workaround in Oracle's advisory.",
        "solution_cn": "目前厂商已经发布了升级补丁以修复此安全问题，补丁获取链接： http://www.oracle.com/technetwork/topics/security/alert-cve-2012-1675-1608180.html",
        "cve": "",
        "plugin_id": "69552"
    },
    "70658": {
        "name_en": "SSH Server CBC Mode Ciphers Enabled",
        "name_cn": "SSH服务器CBC模式密码已启用",
        "risk_en": "Low",
        "risk_cn": "低危",
        "describe_en": "The SSH server is configured to support Cipher Block Chaining (CBC) encryption. This may allow an attacker to recover the plaintext message from the ciphertext. Note that this plugin only checks for the options of the SSH server and does not check for vulnerable software versions.",
        "describe_cn": "SSH服务器配置为支持密码块链接（CBC）加密。这可能允许攻击者从密文中恢复明文消息。注意，这个插件只检查SSH服务器的选项，不检查易受攻击的软件版本。",
        "solution_en": "Contact the vendor or consult product documentation to disable CBC mode cipher encryption, and enable CTR or GCM cipher mode encryption.",
        "solution_cn": "联系供应商或查阅产品文档以禁用CBC模式密码加密，并启用CTR或GCM密码模式加密。",
        "cve": "CVE-2008-5161",
        "plugin_id": "70658"
    },
    "71049": {
        "name_en": "SSH Weak MAC Algorithms Enabled",
        "name_cn": "SSH弱MAC算法已启用",
        "risk_en": "Low",
        "risk_cn": "低危",
        "describe_en": "The remote SSH server is configured to allow either MD5 or 96-bit MAC algorithms, both of which are considered weak. Note that this plugin only checks for the options of the SSH server, and it does not check for vulnerable software versions.",
        "describe_cn": "远程SSH服务器配置为允许MD5或96位MAC算法，这两种算法都被认为是较弱的。注意，这个插件只检查SSH服务器的选项，不检查易受攻击的软件版本。",
        "solution_en": "Contact the vendor or consult product documentation to disable MD5 and 96-bit MAC algorithms.",
        "solution_cn": "请与供应商联系或查阅产品文档以禁用MD5和96位MAC算法。",
        "cve": "",
        "plugin_id": "71049"
    },
    "90317": {
        "name_en": "SSH Weak Algorithms Supported",
        "name_cn": "SSH弱算法支持",
        "risk_en": "Medium",
        "risk_cn": "中危",
        "describe_en": "Nessus has detected that the remote SSH server is configured to use the Arcfour stream cipher or no cipher at all. RFC 4253 advises against using Arcfour due to an issue with weak keys.",
        "describe_cn": "目前该ssh服务采用的算法较低",
        "solution_en": "Contact the vendor or consult product documentation to remove the weak ciphers.",
        "solution_cn": "修改ssh算法采用aes128-cbc或者aes256-cbc",
        "cve": "",
        "plugin_id": "90317"
    },
    "11356": {
        "name_en": "NFS Exported Share Information Disclosure",
        "name_cn": "NFS 共享信息泄露漏洞",
        "risk_en": "Critical",
        "risk_cn": "紧急",
        "describe_en": "At least one of the NFS shares exported by the remote server could be mounted by the scanning host. An attacker may be able to leverage this to read (and possibly write) files on remote host.",
        "describe_cn": "远程攻击者可以装载Ultrix或OSF中的NFS文件系统，即使它在访问列表中被否认。",
        "solution_en": "Configure NFS on the remote host so that only authorized hosts can mount its remote shares.",
        "solution_cn": "配置NFS，限制为仅允许已通过授权的远程主机可以进行远程挂载NFS共享。",
        "cve": "",
        "plugin_id": "11356"
    },
    "15984": {
        "name_en": "NFS Share User Mountable",
        "name_cn": "NFS 共享允许远程挂载",
        "risk_en": "High",
        "risk_cn": "高危",
        "describe_en": "Nessus was either able to mount some of the NFS shares exported by the remote server or disclose potentially sensitive information such as a directory listing. An attacker may exploit this issue to gain read and possibly write access to files on remote host. Note that root privileges were not required to mount the remote shares since the source port to mount the shares was higher than 1024.",
        "describe_cn": "服务器的NFS共享允许通过远程挂载，攻击者可能会利用此漏洞获取远程主机文件的读权限（甚至是写）。",
        "solution_en": "Configure NFS on the remote host so that only authorized hosts can mount the remote shares. The remote NFS server should prevent mount requests originating from a non-privileged port.",
        "solution_cn": "配置NFS，限制为仅允许已通过授权的远程主机可以进行远程挂载NFS共享。",
        "cve": "",
        "plugin_id": "15984"
    },
    "42256": {
        "name_en": "NFS Shares World Readable",
        "name_cn": "NFS 共享可读",
        "risk_en": "Medium",
        "risk_cn": "中危",
        "describe_en": "The remote NFS server is exporting one or more shares without restricting access (based on hostname, IP, or IP range).",
        "describe_cn": "远程NFS服务器允许导出一个或更多的共享，而没有限制访问（如基于主机名，IP或IP范围）。",
        "solution_en": "Place the appropriate restrictions on all NFS shares.",
        "solution_cn": "配置NFS，限制为仅允许已通过授权的远程主机可以进行远程挂载NFS共享。",
        "cve": "",
        "plugin_id": "42256"
    },
    "81777": {
        "name_en": "MongoDB Service Without Authentication Detection",
        "name_cn": "MongoDB没有认证检测服务",
        "risk_en": "Medium",
        "risk_cn": "中危",
        "describe_en": "MongoDB, a document-oriented database system, is listening on the remote port, and it is configured to allow connections without any authentication. A remote attacker can therefore connect to the database system in order to create, read, update, and delete documents, collections, and databases.",
        "describe_cn": "MongoDB,面向文档的数据库系统,是侦听的远程端口，它被配置为允许没有任何的联系身份验证。远程攻击可以连接到数据库系统,以创建、读取、更新和删除 文档、集合和数据库。",
        "solution_en": "Enable authentication or restrict access to the MongoDB service.",
        "solution_cn": "启用身份验证或限制访问到MongoDB服务",
        "cve": "",
        "plugin_id": "81777"
    },
    "15901": {
        "name_en": "SSL Certificate Expiry",
        "name_cn": "SSL证书过期",
        "risk_en": "Medium",
        "risk_cn": "中危",
        "describe_en": "This plugin checks expiry dates of certificates associated with SSL- enabled services on the target and reports whether any have already expired.",
        "describe_cn": "远程主机的SSL证书已经过期。",
        "solution_en": "Purchase or generate a new SSL certificate to replace the existing one.",
        "solution_cn": "购买或生成一个新的SSL证书来替换现有的。",
        "cve": "",
        "plugin_id": "15901"
    },
    "17762": {
        "name_en": "OpenSSL < 0.9.8j Signature Spoofing",
        "name_cn": "OpenSSL版本低于0.9.8j，存在签名验证漏洞",
        "risk_en": "Medium",
        "risk_cn": "中危",
        "describe_en": "According to its banner, the remote server is running a version of OpenSSL that is earlier than 0.9.8j. A remote attacker could implement a man-in-the-middle attack by forging an SSL/TLS signature using DSA and ECDSA keys which bypass validation of the certificate chain.",
        "describe_cn": "OpenSSL是一种开放源码的SSL实现，用来实现网络通信的高强度加密，现在被广泛地用于各种网络应用程序中。某些OpenSSL函数在验证DSA和ECDSA密钥签名时没有正确地验证函数EVP_VerifyFinal()的返回值，畸形的签名可能被处理为有效签名而不是错误。恶意服务器或中间人攻击者可以在证书链中向客户端特制SSL/TLS签名来绕过有效性验证，诱骗客户端错误的信任恶意站点。",
        "solution_en": "Upgrade to OpenSSL 0.9.8j or later.",
        "solution_cn": "升级OpenSSL版本至0.9.8j及以上版本 相关链接： http://www.us-cert.gov/cas/techalerts/TA09-133A.html",
        "cve": "",
        "plugin_id": "17762"
    },
    "17763": {
        "name_en": "OpenSSL < 0.9.8k Denial of Service",
        "name_cn": "OpenSSL版本低于0.9.8k，存在拒绝服务攻击漏洞",
        "risk_en": "Medium",
        "risk_cn": "中危",
        "describe_en": "According to its banner, the remote server is running a version of OpenSSL prior to 0.9.8k. It is, therefore, affected by multiple vulnerabilities : - A denial of service vulnerability exists in the ASN1_STRING_print_ex() function due to improper string handling. A remote attacker can exploit this to cause an invalid memory access and application crash. (CVE-2009-0590) - A flaw exists in the CMS_verify() function due to improper handling of errors associated with malformed signed attributes. A remote attacker can exploit this to repudiate a signature that originally appeared to be valid but was actually invalid. (CVE-2009-0591) - A denial of service vulnerability exists due to improper handling of malformed ASN.1 structures. A remote attacker can exploit this to cause an invalid memory access and application crash. (CVE-2009-0789) - A memory leak exists in the SSL_free() function in ssl_lib.c. A remote attacker can exploit this to exhaust memory resources, resulting in a denial of service condition. (CVE-2009-5146)",
        "describe_cn": "主机OpenSSL版本低于0.9.8K,这使得远程攻击者通过伪造ASN.1数据发起拒绝服务攻击",
        "solution_en": "Upgrade to OpenSSL version 0.9.8k or later.",
        "solution_cn": "升级OpenSSL版本至0.9.8k及以上版本 相关链接： http://www.openssl.org/news/secadv_20090325.txt",
        "cve": "",
        "plugin_id": "17763"
    },
    "17764": {
        "name_en": "OpenSSL < 0.9.8k Signature Repudiation",
        "name_cn": "OpenSSL<0.9.8k签名否认",
        "risk_en": "Low",
        "risk_cn": "低危",
        "describe_en": "According to its banner, the remote server is running a version of OpenSSL that is earlier than 0.9.8k. As such, it may allow a valid sign to generate invalid signatures which would appear valid and could be repudiated later. This only affects CMS users. CMS appeared in OpenSSL 0.9.8h.",
        "describe_cn": "根据它的横幅，远程服务器运行的是早于0.9.8k的OpenSSL版本。因此，它可以允许有效的签名生成无效的签名，这些签名看起来是有效的，并且可以在以后被拒绝。这只影响CMS用户。CMS出现在openssl0.9.8h中。",
        "solution_en": "Upgrade to OpenSSL 0.9.8k or later.",
        "solution_cn": "升级至OpenSSL 0.9.8k或更高版本。",
        "cve": "CVE-2009-0591"
    },
    "17765": {
        "name_en": "OpenSSL < 0.9.8l Multiple Vulnerabilities",
        "name_cn": "OpenSSL版本低于0.9.8l，存在多个安全漏洞",
        "risk_en": "Medium",
        "risk_cn": "中危",
        "describe_en": "According to its banner, the remote server is running a version of OpenSSL that is earlier than 0.9.8l. As such, it may be affected by multiple vulnerabilities : - A remote attacker could crash the server by sending malformed ASN.1 data. This flaw only affects some architectures, Win64 and other unspecified platforms. (CVE-2009-0789) - A remote attacker could saturate the server by sending a big number of 'future epoch' DTLS records. (CVE-2009-1377) - A remote attacker could saturate the server by sending duplicate DTLS records, or DTLS records with too big sequence numbers. (CVE-2009-1378) - A remote attacker could spoof certificates by computing MD2 hash collisions. (CVE-2009-2409)",
        "describe_cn": "主机OpenSSL版本低于0.9.8l,这使得主机存在多个安全漏洞。",
        "solution_en": "Upgrade to OpenSSL 0.9.8l or later.",
        "solution_cn": "升级OpenSSL版本至0.9.8l及以上版本 相关链接： http://voodoo-circle.sourceforge.net/sa/sa-20090326-01.html http://www.openssl.org/news/secadv_20090325.txt http://voodoo-circle.sourceforge.net/sa/sa-20091012-01.html http://rt.openssl.org/Ticket/Display.html?id=1930&user=guest&pass=guest http://rt.openssl.org/Ticket/Display.html?id=1931&user=guest&pass=guest http://cvs.openssl.org/chngview?cn=18187 http://cvs.openssl.org/chngview?cn=18188",
        "cve": "",
        "plugin_id": "17765"
    },
    "17766": {
        "name_en": "OpenSSL < 0.9.8p / 1.0.0b Buffer Overflow",
        "name_cn": "OpenSSL版本低于0.9.8p / 1.0.0b，存在缓冲区溢出漏洞",
        "risk_en": "High",
        "risk_cn": "高危",
        "describe_en": "According to its banner, the remote server is running a version of OpenSSL that is earlier than 0.9.8p / 1.0.0b. If a TLS server is multithreaded and uses the SSL cache, a remote attacker could trigger a buffer overflow and crash the server or run arbitrary code.",
        "describe_cn": "OpenSSL是一种开放源码的SSL实现，用来实现网络通信的高强度加密，现被广泛地用于各种网络应用程序中。当TLS服务器中的多线程和内部缓存被启用时，OpenSSL 0.9.8f至0.9.8o版本，1.0.0版本，以及1.0.0a版本中的ssl/t1_lib.c文件中存在多个竞争条件漏洞。远程攻击者可以借助能够触发堆缓冲区溢出的客户端数据执行任意代码。该漏洞与(1)TLS服务器名称扩展以及(2)椭圆曲线密码系统有关。",
        "solution_en": "Upgrade to OpenSSL 0.9.8p / 1.0.0b or later.",
        "solution_cn": "升级 OpenSSL版本至0.9.8p / 1.0.0b及以上版本。 相关链接： http://openssl.org/news/secadv_20101116.txt",
        "cve": "",
        "plugin_id": "17766"
    },
    "17767": {
        "name_en": "OpenSSL < 0.9.8p / 1.0.0e Double Free Vulnerability",
        "name_cn": "OpenSSL版本低于0.9.8p / 1.0.0e，存在双重释放漏洞",
        "risk_en": "Medium",
        "risk_cn": "中危",
        "describe_en": "According to its banner, the remote server is running a version of OpenSSL that is earlier than 0.9.8p / 1.0.0e. A remote attacker could crash client software when using ECDH. The impact of this vulnerability is not clear; arbitrary code could be run too. Note that OpenSSL changelog only reports a fix for 0.9.8p. 1.0.0a is definitely vulnerable. Gentoo reports a fix for 1.0.0e but it covers other flaws.NVD reports 0.9.7 as vulnerable too but does not give any fixed version.",
        "describe_cn": "OpenSSL是一种开放源码的SSL实现，用来实现网络通信的高强度加密，现在被广泛地用于各种网络应用程序中。OpenSSL 1.0.0a，0.9.8，0.9.7版本和其他可能版本中的OpenSSL客户端(ssl/s3_clnt.c)中的ssl3_get_key_exchange函数存在双重释放漏洞，当ECDH启用时，附近攻击者可以借助特制的无效质数私钥导致拒绝服务（崩溃）。",
        "solution_en": "Upgrade to OpenSSL 0.9.8p / 1.0.0e or later.",
        "solution_cn": "升级 OpenSSL版本至0.9.8p / 1.0.0e及以上版本。 相关链接： http://www.mail-archive.com/openssl-dev@openssl.org/msg28049.html",
        "cve": "",
        "plugin_id": "17767"
    },
    "26928": {
        "name_en": "SSL Weak Cipher Suites Supported",
        "name_cn": "SSL 允许采用弱加密组件",
        "risk_en": "Medium",
        "risk_cn": "中危",
        "describe_en": "The remote host supports the use of SSL ciphers that offer weak encryption. Note: This is considerably easier to exploit if the attacker is on the same physical network.",
        "describe_cn": "远程主机支持采用弱加密或完全不用加密的SSL加密。",
        "solution_en": "Reconfigure the affected application, if possible to avoid the use of weak ciphers.",
        "solution_cn": "重新配置可能受影响的应用程序；如果可能，避免使用弱加密。",
        "cve": "",
        "plugin_id": "26928"
    },
    "35750": {
        "name_en": "PHP < 5.2.9 Multiple Vulnerabilities",
        "name_cn": "PHP版本低于5.2.9",
        "risk_en": "Medium",
        "risk_cn": "中危",
        "describe_en": "According to its banner, the version of PHP installed on the remote host is older than 5.2.9. Such versions may be affected by several security issues : - Background color is not correctly validated with a non true color image in function 'imagerotate()'. (CVE-2008-5498) - A denial of service condition can be triggered by trying to extract zip files that contain files with relative paths in file or directory names. - Function 'explode()' is affected by an unspecified vulnerability. - It may be possible to trigger a segfault by passing a specially crafted string to function 'json_decode()'. - Function 'xml_error_string()' is affected by a flaw which results in messages being off by one.",
        "describe_cn": "PHP版本低于5.2.9，可能会受到多个漏洞影响。",
        "solution_en": "Upgrade to PHP version 5.2.9 or later.",
        "solution_cn": "升级PHP版本到5.2.9以上",
        "cve": "",
        "plugin_id": "35750"
    },
    "39480": {
        "name_en": "PHP < 5.2.10 Multiple Vulnerabilities",
        "name_cn": "PHP版本低于5.2.10 ，导致多个漏洞",
        "risk_en": "Medium",
        "risk_cn": "中危",
        "describe_en": "According to its banner, the version of PHP installed on the remote host is older than 5.2.10. Such versions are reportedly affected by multiple vulnerabilities : - Sufficient checks are not performed on fields reserved for offsets in function 'exif_read_data()'. Successful exploitation of this issue could result in a denial of service condition. (bug 48378) - Provided 'safe_mode_exec_dir' is not set (not set by default), it may be possible to bypass 'safe_mode' restrictions by preceding a backslash in functions such as 'exec()', 'system()', 'shell_exec()', 'passthru()' and 'popen()' on a system running PHP on Windows. (bug 45997)",
        "describe_cn": "PHP版本低，可能会受到多个漏洞影响。",
        "solution_en": "Upgrade to PHP version 5.2.10 or later.",
        "solution_cn": "升级PHP版本到5.2.10以上",
        "cve": "",
        "plugin_id": "39480"
    },
    "40467": {
        "name_en": "Apache 2.x < 2.2.12 Multiple Vulnerabilities",
        "name_cn": "Apache 版本低于 2.2.12",
        "risk_en": "High",
        "risk_cn": "高危",
        "describe_en": "According to its banner, the version of Apache 2.2.x. running on the remote host is prior to 2.2.12. It is, therefore, affected by the following vulnerabilities : - A heap-based buffer underwrite flaw exists in the function 'apr_strmatch_precompile()' in the bundled copy of the APR-util library, which could be triggered when parsing configuration data to crash the daemon. (CVE-2009-0023) - A flaw in the mod_proxy_ajp module in version 2.2.11 only may allow a remote attacker to obtain sensitive response data intended for a client that sent an earlier POST request with no request body. (CVE-2009-1191) - The server does not limit the use of directives in a .htaccess file as expected based on directives such as 'AllowOverride' and 'Options' in the configuration file, which could enable a local user to bypass security restrictions. (CVE-2009-1195) - Failure to properly handle an amount of streamed data that exceeds the Content-Length value allows a remote attacker to force a proxy process to consume CPU time indefinitely when mod_proxy is used in a reverse proxy configuration. (CVE-2009-1890) - Failure of mod_deflate to stop compressing a file when the associated network connection is closed may allow a remote attacker to consume large amounts of CPU if there is a large (>10 MB) file available that has mod_deflate enabled. (CVE-2009-1891) - Using a specially crafted XML document with a large number of nested entities, a remote attacker may be able to consume an excessive amount of memory due to a flaw in the bundled expat XML parser used by the mod_dav and mod_dav_svn modules. (CVE-2009-1955) - There is an off-by-one overflow in the function 'apr_brigade_vprintf()' in the bundled copy of the APR-util library in the way it handles a variable list of arguments, which could be leveraged on big-endian platforms to perform information disclosure or denial of service attacks. (CVE-2009-1956) Note that Nessus has relied solely on the version in the Server response header and did not try to check for the issues themselves or even whether the affected modules are in use.",
        "describe_cn": "Apache版本较低，导致存在多处漏洞。",
        "solution_en": "Upgrade to Apache version 2.2.12 or later. Alternatively, ensure that the affected modules / directives are not in use.",
        "solution_cn": "升级apache版本到2.2.12以上 http://httpd.apache.org/",
        "cve": "",
        "plugin_id": "40467"
    },
    "41014": {
        "name_en": "PHP < 5.2.11 Multiple Vulnerabilities",
        "name_cn": "PHP版本低于5.2.11",
        "risk_en": "High",
        "risk_cn": "高危",
        "describe_en": "According to its banner, the version of PHP installed on the remote host is older than 5.2.11. Such versions may be affected by several security issues : - An unspecified error occurs in certificate validation inside 'php_openssl_apply_verification_policy'. - An unspecified input validation vulnerability affects the color index in 'imagecolortransparent()'. - An unspecified input validation vulnerability affects exif processing. - Calling 'popen()' with an invalid mode can cause a crash under Windows. (Bug #44683) - An integer overflow in 'xml_utf8_decode()' can make it easier to bypass cross-site scripting and SQL injection protection mechanisms using a specially crafted string with a long UTF-8 encoding. (Bug #49687) - 'proc_open()' can bypass 'safe_mode_protected_env_vars'. (Bug #49026)",
        "describe_cn": "Apache版本低，可能会受到多个漏洞影响。",
        "solution_en": "Upgrade to PHP version 5.2.11 or later.",
        "solution_cn": "升级PHP版本到5.2.11以上",
        "cve": "",
        "plugin_id": "41014"
    },
    "42052": {
        "name_en": "Apache 2.2 < 2.2.14 Multiple Vulnerabilities",
        "name_cn": "Apache版本低于2.2.14",
        "risk_en": "High",
        "risk_cn": "高危",
        "describe_en": "According to its banner, the version of Apache 2.2.x running on the remote host is prior to 2.2.14. It is, therefore, potentially affected by multiple vulnerabilities : - Faulty error handling in the Solaris pollset support could lead to a denial of service. (CVE-2009-2699) - The 'mod_proxy_ftp' module allows remote attackers to bypass intended access restrictions. (CVE-2009-3095) - The 'ap_proxy_ftp_handler' function in 'modules/proxy/proxy_ftp.c' in the 'mod_proxy_ftp' module allows remote FTP servers to cause a denial of service. (CVE-2009-3094) Note that the remote web server may not actually be affected by these vulnerabilities as Nessus did not try to determine whether the affected modules are in use or check for the issues themselves.",
        "describe_cn": "Apache版本较低，导致存在多处漏洞。",
        "solution_en": "Upgrade to Apache version 2.2.14 or later. Alternatively, ensure that the affected modules are not in use.",
        "solution_cn": "升级apache版本到2.2.29以上 http://httpd.apache.org/",
        "cve": "",
        "plugin_id": "42052"
    },
    "42880": {
        "name_en": "SSL / TLS Renegotiation Handshakes MiTM Plaintext Data Injection",
        "name_cn": "SSL/TLS握手过程中间人明文注入攻击",
        "risk_en": "Medium",
        "risk_cn": "中危",
        "describe_en": "The remote service encrypts traffic using TLS / SSL but allows a client to insecurely renegotiate the connection after the initial handshake. An unauthenticated, remote attacker may be able to leverage this issue to inject an arbitrary amount of plaintext into the beginning of the application protocol stream, which could facilitate man-in-the-middle attacks if the service assumes that the sessions before and after renegotiation are from the same 'client' and merges them at the application layer.",
        "describe_cn": "在SSL/TLS握手协议连接过程中，数据通信过程采用明文数据，这可能遭受中间人攻击，攻击者通过篡改明文数据，实现伪装。",
        "solution_en": "Contact the vendor for specific patch information.",
        "solution_cn": "联系厂商获取相关补丁包。 http://www.ietf.org/mail-archive/web/tls/current/msg03948.html http://www.g-sec.lu/practicaltls.pdf http://tools.ietf.org/html/rfc5746",
        "cve": "",
        "plugin_id": "42880"
    },
    "43351": {
        "name_en": "PHP < 5.2.12 Multiple Vulnerabilities",
        "name_cn": "PHP版本低导致多个漏洞",
        "risk_en": "Medium",
        "risk_cn": "中危",
        "describe_en": "According to its banner, the version of PHP installed on the remote host is older than 5.2.12. Such versions may be affected by several security issues : - It is possible to bypass the 'safe_mode' configuration setting using 'tempnam()'. (CVE-2009-3557) - It is possible to bypass the 'open_basedir' configuration setting using 'posix_mkfifo()'. (CVE-2009-3558) - Provided file uploading is enabled (it is by default), an attacker can upload files using a POST request with 'multipart/form-data' content even if the target script doesn't actually support file uploads per se. By supplying a large number (15,000+) of files, an attacker could cause the web server to stop responding while it processes the file list. (CVE-2009-4017) - Missing protection for '$_SESSION' from interrupt corruption and improved 'session.save_path' check. (CVE-2009-4143) - Insufficient input string validation in the 'htmlspecialchars()' function. (CVE-2009-4142)",
        "describe_cn": "Apache版本低，可能会受到多个漏洞影响。",
        "solution_en": "Upgrade to PHP version 5.2.12 or later.",
        "solution_cn": "升级PHP版本到5.2.12以上",
        "cve": "",
        "plugin_id": "43351"
    },
    "44921": {
        "name_en": "PHP < 5.3.2 / 5.2.13 Multiple Vulnerabilities",
        "name_cn": "PHP版本低于5.3.2 / 5.2.13",
        "risk_en": "Medium",
        "risk_cn": "中危",
        "describe_en": "According to its banner, the version of PHP installed on the remote host is older than 5.3.2 / 5.2.13. Such versions may be affected by several security issues : - Directory paths not ending with '/' may not be correctly validated inside 'tempnam()' in 'safe_mode' configuration. - It may be possible to bypass the 'open_basedir'/ 'safe_mode' configuration restrictions due to an error in session extensions. - An unspecified vulnerability affects the LCG entropy.",
        "describe_cn": "Apache版本低，可能会受到多个漏洞影响。",
        "solution_en": "Upgrade to PHP version 5.3.2 / 5.2.13 or later.",
        "solution_cn": "升级PHP版本到5.3.2以上",
        "cve": "",
        "plugin_id": "44921"
    },
    "45004": {
        "name_en": "Apache 2.2 < 2.2.15 Multiple Vulnerabilities",
        "name_cn": "Apache版本低于2.2.15",
        "risk_en": "Critical",
        "risk_cn": "紧急",
        "describe_en": "According to its banner, the version of Apache 2.2.x running on the remote host is prior to 2.2.15. It is, therefore, potentially affected by multiple vulnerabilities : - A TLS renegotiation prefix injection attack is possible. (CVE-2009-3555) - The 'mod_proxy_ajp' module returns the wrong status code if it encounters an error which causes the back-end server to be put into an error state. (CVE-2010-0408) - The 'mod_isapi' attempts to unload the 'ISAPI.dll' when it encounters various error states which could leave call-backs in an undefined state. (CVE-2010-0425) - A flaw in the core sub-request process code can lead to sensitive information from a request being handled by the wrong thread if a multi-threaded environment is used. (CVE-2010-0434) - Added 'mod_reqtimeout' module to mitigate Slowloris attacks. (CVE-2007-6750)",
        "describe_cn": "Apache版本低，可能会受到多个漏洞影响。",
        "solution_en": "Upgrade to Apache version 2.2.15 or later.",
        "solution_cn": "升级apache版本到2.2.15以上 http://httpd.apache.org/",
        "cve": "",
        "plugin_id": "45004"
    },
    "45112": {
        "name_en": "FileZilla Server < 0.9.31 Denial of Service",
        "name_cn": "FileZilla版本低于0.9.31 导致拒绝服务攻击漏洞",
        "risk_en": "Medium",
        "risk_cn": "中危",
        "describe_en": "According to its banner, the version of FileZilla Server installed on the remote host is older than version 0.9.31. An unspecified vulnerability in the SSL code for such versions can be exploited by a remote attacker to trigger a denial of service condition.",
        "describe_cn": "经过测试，发现服务器上FileZilla版本低于0.9.31，这种版本的SSL代码未知漏洞可被远程攻击者引发拒绝服务的情况。",
        "solution_en": "Upgrade to FileZilla Server version 0.9.31 or later.",
        "solution_cn": "升级到FileZilla到0.9.31或者更新版本",
        "cve": "",
        "plugin_id": "45112"
    },
    "48205": {
        "name_en": "Apache 2.2 < 2.2.16 Multiple Vulnerabilities",
        "name_cn": "Apache版本低于2.2.16",
        "risk_en": "Medium",
        "risk_cn": "中危",
        "describe_en": "According to its banner, the version of Apache 2.2.x running on the remote host is prior to 2.2.16. It is, therefore, potentially affected by multiple vulnerabilities : - A denial of service vulnerability in mod_cache and mod_dav. (CVE-2010-1452) - An information disclosure vulnerability in mod_proxy_ajp, mod_reqtimeout, and mod_proxy_http relating to timeout conditions. Note that this issue only affects Apache on Windows, Netware, and OS/2. (CVE-2010-2068) Note that the remote web server may not actually be affected by these vulnerabilities. Nessus did not try to determine whether the affected modules are in use or to check for the issues themselves.",
        "describe_cn": "Apache版本较低，导致存在多处漏洞。",
        "solution_en": "Upgrade to Apache version 2.2.16 or later.",
        "solution_cn": "升级apache版本到2.2.16以上 http://httpd.apache.org/",
        "cve": "",
        "plugin_id": "48205"
    },
    "48244": {
        "name_en": "PHP 5.2 < 5.2.14 Multiple Vulnerabilities",
        "name_cn": "PHP版本低于5.2.14",
        "risk_en": "High",
        "risk_cn": "高危",
        "describe_en": "According to its banner, the version of PHP 5.2 installed on the remote host is older than 5.2.14. Such versions may be affected by several security issues : - An error exists when processing invalid XML-RPC requests that can lead to a NULL pointer dereference. (bug #51288) (CVE-2010-0397) - An error exists in the function 'fnmatch' that can lead to stack exhaustion. - An error exists in the sqlite extension that could allow arbitrary memory access. - A memory corruption error exists in the function 'substr_replace'. - The following functions are not properly protected against function interruptions : addcslashes, chunk_split, html_entity_decode, iconv_mime_decode, iconv_substr, iconv_mime_encode, htmlentities, htmlspecialchars, str_getcsv, http_build_query, strpbrk, strstr, str_pad, str_word_count, wordwrap, strtok, setcookie, strip_tags, trim, ltrim, rtrim, parse_str, pack, unpack, uasort, preg_match, strrchr, strchr, substr, str_repeat (CVE-2010-1860, CVE-2010-1862, CVE-2010-1864, CVE-2010-2097, CVE-2010-2100, CVE-2010-2101, CVE-2010-2190, CVE-2010-2191, CVE-2010-2484) - The following opcodes are not properly protected against function interruptions : ZEND_CONCAT, ZEND_ASSIGN_CONCAT, ZEND_FETCH_RW (CVE-2010-2191) - The default session serializer contains an error that can be exploited when assigning session variables having user defined names. Arbitrary serialized values can be injected into sessions by including the PS_UNDEF_MARKER, '!', character in variable names. - A use-after-free error exists in the function 'spl_object_storage_attach'. (CVE-2010-2225) - An information disclosure vulnerability exists in the function 'var_export' when handling certain error conditions. (CVE-2010-2531)",
        "describe_cn": "Apache版本低，可能会受到多个漏洞影响。",
        "solution_en": "Upgrade to PHP version 5.2.14 or later.",
        "solution_cn": "升级PHP版本到5.2.14以上",
        "cve": "",
        "plugin_id": "48244"
    },
    "50070": {
        "name_en": "Apache 2.2 < 2.2.17 Multiple Vulnerabilities",
        "name_cn": "Apache版本较低于2.2.17",
        "risk_en": "Medium",
        "risk_cn": "中危",
        "describe_en": "According to its banner, the version of Apache 2.2.x running on the remote host is prior to 2.2.17. It is, therefore, affected by the following vulnerabilities : - Errors exist in the bundled expat library that may allow an attacker to crash the server when a buffer is over- read when parsing an XML document. (CVE-2009-3720 and CVE-2009-3560) - An error exists in the 'apr_brigade_split_line' function in the bundled APR-util library. Carefully timed bytes in requests result in gradual memory increases leading to a denial of service. (CVE-2010-1623) Note that the remote web server may not actually be affected by these vulnerabilities. Nessus did not try to determine whether the affected modules are in use or to check for the issues themselves.",
        "describe_cn": "Apache版本较低，导致存在多处漏洞。",
        "solution_en": "Upgrade to Apache version 2.2.17 or later. Alternatively, ensure that the affected modules are not in use.",
        "solution_cn": "升级apache版本到2.2.17以上 http://httpd.apache.org/",
        "cve": "",
        "plugin_id": "50070"
    },
    "51139": {
        "name_en": "PHP 5.2 < 5.2.15 Multiple Vulnerabilities",
        "name_cn": "PHP版本低于5.2.15",
        "risk_en": "Medium",
        "risk_cn": "中危",
        "describe_en": "According to its banner, the version of PHP 5.2 installed on the remote host is older than 5.2.15. Such versions may be affected by several security issues : - A crash in the zip extract method. - A possible double free exists in the imap extension. (CVE-2010-4150) - An unspecified flaw exists in 'open_basedir'. (CVE-2010-3436) - A possible crash could occur in 'mssql_fetch_batch()'. - A NULL pointer dereference exists in 'ZipArchive::getArchiveComment'. (CVE-2010-3709) - A crash exists if anti-aliasing steps are invalid. (Bug #53492) - A crash exists in pdo_firebird getAttribute(). (Bug #53323) - A user-after-free vulnerability in the Zend engine when a '__set()', '__get()', '__isset()' or '__unset()' method is called can allow for a denial of service attack. (Bug #52879 / CVE-2010-4697) - A stack-based buffer overflow exists in the 'imagepstext()' function in the GD extension. (Bug #53492 / CVE-2010-4698) - The extract function does not prevent use of the EXTR_OVERWRITE parameter to overwrite the GLOBALS superglobal array and the 'this' variable, which allows attackers to bypass intended access restrictions. (CVE-2011-0752)",
        "describe_cn": "Apache版本低，可能会受到多个漏洞影响。",
        "solution_en": "Upgrade to PHP version 5.2.15 or later.",
        "solution_cn": "升级PHP版本到5.2.15以上",
        "cve": "",
        "plugin_id": "51139"
    },
    "51439": {
        "name_en": "PHP 5.2 < 5.2.17 / 5.3 < 5.3.5 String To Double Conversion DoS",
        "name_cn": "PHP 版本低于5.2.17 / 5.3 < 5.3.5 拒绝服务攻击漏洞",
        "risk_en": "Medium",
        "risk_cn": "中危",
        "describe_en": "According to its banner, the version of PHP 5.x installed on the remote host is older than 5.2.17 or 5.3.5. Such versions may experience a crash while performing string to double conversion for certain numeric values. Only x86 32-bit PHP processes are known to be affected by this issue regardless of whether the system running PHP is 32-bit or 64-bit.",
        "describe_cn": "PHP版本低于5.2.17或低于5.3.5，这可能受到拒绝服务攻击。",
        "solution_en": "Upgrade to PHP 5.2.17/5.3.5 or later.",
        "solution_cn": "升级PHP版本至5.3.5及以上版本。",
        "cve": "",
        "plugin_id": "51439"
    },
    "51892": {
        "name_en": "OpenSSL SSL_OP_NETSCAPE_REUSE_CIPHER_CHANGE_BUG Session Resume Ciphersuite Downgrade Issue",
        "name_cn": "OpenSSL密码集降级安全漏洞",
        "risk_en": "Medium",
        "risk_cn": "中危",
        "describe_en": "The version of OpenSSL on the remote host has been shown to allow resuming session with a weaker cipher than was used when the session was initiated. This means that an attacker that sees (i.e., by sniffing) the start of an SSL connection can manipulate the OpenSSL session cache to cause subsequent resumptions of that session to use a weaker cipher chosen by the attacker. Note that other SSL implementations may also be affected by this vulnerability.",
        "describe_cn": "OpenSSL是一种开放源码的SSL实现，用来实现网络通信的高强度加密，现在被广泛地用于各种网络应用程序中。当SSL_OP_NETSCAPE_REUSE_CIPHER_CHANGE_BUG启用时，OpenSSL 0.9.8q之前版本及1.0.0c之前的1.0.x版本不能正确阻止会话缓存中对加密套接字的修改。远程攻击者可借助和嗅探网络通信以发现会话标识符有关的向量强迫意外密码降低保密程度。",
        "solution_en": "Upgrade to OpenSSL 0.9.8q / 1.0.0.c or later, or contact your vendor for a patch.",
        "solution_cn": "升级版本至 OpenSSL 0.9.8q / 1.0.0.c或者联系厂商。 相关链接： http://openssl.org/news/secadv_20101202.txt",
        "cve": "",
        "plugin_id": "51892"
    },
    "53896": {
        "name_en": "Apache 2.2 < 2.2.18 APR apr_fnmatch DoS",
        "name_cn": "Apache版本低于2.2.18",
        "risk_en": "Medium",
        "risk_cn": "中危",
        "describe_en": "According to its banner, the version of Apache 2.2.x running on the remote host is prior to 2.2.18. It is, therefore, affected by a denial of service vulnerability due to an error in the apr_fnmatch() function of the bundled APR library. If mod_autoindex is enabled and has indexed a directory containing files whose filenames are long, an attacker can cause high CPU usage with a specially crafted request. Note that the remote web server may not actually be affected by this vulnerability. Nessus did not try to determine whether the affected module is in use or to check for the issue itself.",
        "describe_cn": "Apache版本较低，由于发生在 'apr_fnmatch'函数的错误，可能会受到DOS攻击。",
        "solution_en": "Upgrade to Apache version 2.2.18 or later. Alternatively, ensure that the 'IndexOptions' configuration option is set to 'IgnoreClient'.",
        "solution_cn": "确保 'IndexOptions' 设置选项设置为 'IgnoreClient'，或者升级Apache版本至2.2.18及以上。",
        "cve": "",
        "plugin_id": "53896"
    },
    "56216": {
        "name_en": "Apache 2.2 < 2.2.21 mod_proxy_ajp DoS",
        "name_cn": "Apache版本低于2.2.21 导致mod_proxy_ajp 漏洞",
        "risk_en": "Medium",
        "risk_cn": "中危",
        "describe_en": "According to its banner, the version of Apache 2.2.x running on the remote host is prior to 2.2.21. It is, therefore, potentially affected by a denial of service vulnerability. An error exists in the 'mod_proxy_ajp' module that can allow specially crafted HTTP requests to cause a backend server to temporarily enter an error state. This vulnerability only occurs when 'mod_proxy_ajp' is used along with 'mod_proxy_balancer'. Note that Nessus did not actually test for the flaws but instead has relied on the version in the server's banner.",
        "describe_cn": "Apache版本较低，由于发生在 'mod_proxy_ajp '函数的错误，可能会受到DOS攻击。",
        "solution_en": "Upgrade to Apache version 2.2.21 or later.",
        "solution_cn": "升级Apache版本至2.2.21及以上。",
        "cve": "",
        "plugin_id": "56216"
    },
    "57459": {
        "name_en": "OpenSSL < 0.9.8s Multiple Vulnerabilities",
        "name_cn": "OpenSSL版本低于0.9.8s，存在多个安全漏洞",
        "risk_en": "High",
        "risk_cn": "高危",
        "describe_en": "According to its banner, the remote web server is running a version of OpenSSL older than 0.9.8s. Such versions have the following vulnerabilities : - An error exists related to ECDSA signatures and binary curves. The implementation of curves over binary fields could allow a remote, unauthenticated attacker to determine private key material via timing attacks. (CVE-2011-1945) - The Datagram Transport Layer Security (DTLS) implementation is vulnerable to plaintext recovery attacks when decrypting in CBC mode. (CVE-2011-4108) - A double-free error exists during a policy check failure if the flag 'X509_V_FLAG_POLICY_CHECK' is set. (CVE-2011-4109) - An error exists related to SSLv3.0 records that can lead to disclosure of uninitialized memory because the library does not clear all bytes used as block cipher padding. (CVE-2011-4576) - An error exists related to RFC 3779 processing that can allow denial of service attacks. Note that this functionality is not enabled by default and must be configured at compile time via the 'enable-rfc3779' option. (CVE-2011-4577) - An error exists related to handshake restarts for server gated cryptography (SGC) that can allow denial of service attacks. (CVE-2011-4619)",
        "describe_cn": "主机OpenSSL版本低于0.9.8s,这使得主机存在多个安全漏洞。",
        "solution_en": "Upgrade to OpenSSL 0.9.8s or later.",
        "solution_cn": "升级OpenSSL版本至0.9.8s及以上版本，或者使用厂家发布的补丁包进行升级 相关链接： http://openssl.org/news/secadv_20120104.txt http://www.openssl.org/news/changelog.html http://www.nessus.org/u?c0f10f36 http://eprint.iacr.org/2011/232.pdf http://cvs.openssl.org/chngview?cn=21301",
        "cve": "",
        "plugin_id": "57459"
    },
    "57537": {
        "name_en": "PHP < 5.3.9 Multiple Vulnerabilities",
        "name_cn": "PHP版本低于5.3.9 导致多个漏洞",
        "risk_en": "High",
        "risk_cn": "高危",
        "describe_en": "According to its banner, the version of PHP installed on the remote host is older than 5.3.9. As such, it may be affected by the following security issues : - The 'is_a()' function in PHP 5.3.7 and 5.3.8 triggers a call to '__autoload()'. (CVE-2011-3379) - It is possible to create a denial of service condition by sending multiple, specially crafted requests containing parameter values that cause hash collisions when computing the hash values for storage in a hash table. (CVE-2011-4885) - An integer overflow exists in the exif_process_IFD_TAG function in exif.c that can allow a remote attacker to read arbitrary memory locations or cause a denial of service condition. This vulnerability only affects PHP 5.4.0beta2 on 32-bit platforms. (CVE-2011-4566) - Calls to libxslt are not restricted via xsltSetSecurityPrefs(), which could allow an attacker to create or overwrite files, resulting in arbitrary code execution. (CVE-2012-0057) - An error exists in the function 'tidy_diagnose' that can allow an attacker to cause the application to dereference a NULL pointer. This causes the application to crash. (CVE-2012-0781) - The 'PDORow' implementation contains an error that can cause application crashes when interacting with the session feature. (CVE-2012-0788) - An error exists in the timezone handling such that repeated calls to the function 'strtotime' can allow a denial of service attack via memory consumption. (CVE-2012-0789)",
        "describe_cn": "Apache版本低，可能会受到多个漏洞影响。",
        "solution_en": "Upgrade to PHP version 5.3.9 or later.",
        "solution_cn": "升级PHP版本到5.3.9以上",
        "cve": "",
        "plugin_id": "57537"
    },
    "57603": {
        "name_en": "Apache 2.2 < 2.2.13 APR apr_palloc Heap Overflow",
        "name_cn": "Apache版本于2.2.13导致“apr_palloc”缓冲区溢出漏洞",
        "risk_en": "Critical",
        "risk_cn": "紧急",
        "describe_en": "According to its self-reported banner, the version of Apache 2.2.x running on the remote host is prior to 2.2.13. As such, it includes a bundled version of the Apache Portable Runtime (APR) library that contains a flaw in 'apr_palloc()' that could cause a heap overflow. Note that the Apache HTTP server itself does not pass unsanitized, user-provided sizes to this function so it could only be triggered through some other application that uses it in a vulnerable way.",
        "describe_cn": "Apache版本低，可能会受到“apr_palloc”缓冲区溢出漏洞攻击。",
        "solution_en": "Upgrade to Apache 2.2.13 or later.",
        "solution_cn": "升级apache版本到2.2.13以上 http://httpd.apache.org/security/vulnerabilities_22.html",
        "cve": "",
        "plugin_id": "57603"
    },
    "57791": {
        "name_en": "Apache 2.2 < 2.2.22 Multiple Vulnerabilities",
        "name_cn": "Apache版本低于2.2.22",
        "risk_en": "Medium",
        "risk_cn": "中危",
        "describe_en": "According to its banner, the version of Apache 2.2.x installed on the remote host is prior to 2.2.22. It is, therefore, potentially affected by the following vulnerabilities : - When configured as a reverse proxy, improper use of the RewriteRule and ProxyPassMatch directives could cause the web server to proxy requests to arbitrary hosts. This could allow a remote attacker to indirectly send requests to intranet servers. (CVE-2011-3368, CVE-2011-4317) - A heap-based buffer overflow exists when mod_setenvif module is enabled and both a maliciously crafted 'SetEnvIf' directive and a maliciously crafted HTTP request header are used. (CVE-2011-3607) - A format string handling error can allow the server to be crashed via maliciously crafted cookies. (CVE-2012-0021) - An error exists in 'scoreboard.c' that can allow local attackers to crash the server during shutdown. (CVE-2012-0031) - An error exists in 'protocol.c' that can allow 'HTTPOnly' cookies to be exposed to attackers through the malicious use of either long or malformed HTTP headers. (CVE-2012-0053) - An error in the mod_proxy_ajp module when used to connect to a backend server that takes an overly long time to respond could lead to a temporary denial of service. (CVE-2012-4557) Note that Nessus did not actually test for these flaws, but instead has relied on the version in the server's banner.",
        "describe_cn": "Apache版本较低，导致存在多处漏洞。",
        "solution_en": "Upgrade to Apache version 2.2.22 or later.",
        "solution_cn": "升级apache版本到2.2.22以上 http://httpd.apache.org/",
        "cve": "",
        "plugin_id": "57791"
    },
    "58564": {
        "name_en": "OpenSSL < 0.9.8u Multiple Vulnerabilities",
        "name_cn": "OpenSSL版本低于0.9.9s，存在多个安全漏洞",
        "risk_en": "Medium",
        "risk_cn": "中危",
        "describe_en": "According to its banner, the remote web server uses an OpenSSL version prior to 0.9.8u. As such, it is reportedly affected by the following vulnerabilities : - An error exists in the function 'mime_hdr_cmp' that could allow a NULL pointer to be dereferenced when parsing certain MIME headers. (CVE-2006-7250) - The fix for CVE-2011-4619 was not complete. - An error exists in the Cryptographic Message Syntax (CMS) and PKCS #7 implementation such that data can be decrypted using Million Message Attack (MMA) adaptive chosen cipher text attack. (CVE-2012-0884) - An error exists in the function 'mime_param_cmp' in the file 'crypto/asn1/asn_mime.c' that can allow a NULL pointer to be dereferenced when handling certain S/MIME content. (CVE-2012-1165) Note that SSL/TLS applications are not necessarily affected, but those using CMS, PKCS #7 and S/MIME decryption operations are.",
        "describe_cn": "主机OpenSSL版本低于0.9.9u,这使得主机存在多个安全漏洞。",
        "solution_en": "Upgrade to OpenSSL 0.9.8u or later.",
        "solution_cn": "升级OpenSSL版本至0.9.8u及以上版本，或者使用厂家发布的补丁包进行升级 相关链接： http://marc.info/?l=openssl-dev&amp;m=115685408414194&amp;w=2 http://openssl.org/news/secadv_20120312.txt http://www.openssl.org/news/changelog.html http://www.openwall.com/lists/oss-security/2012/03/13/2 http://www.openwall.com/lists/oss-security/2012/02/28/14 http://www.nessus.org/u?4a3e3c8e http://rt.openssl.org/Ticket/Display.html?id=2711&user=guest&pass=guest",
        "cve": "",
        "plugin_id": "58564"
    },
    "58799": {
        "name_en": "OpenSSL < 0.9.8w ASN.1 asn1_d2i_read_bio Memory Corruption",
        "name_cn": "OpenSSL版本低于0.9.8w，ASN.1 asn1_d2i_read_bio内存破坏漏洞",
        "risk_en": "High",
        "risk_cn": "高危",
        "describe_en": "According to its banner, the remote web server is running a version of OpenSSL earlier than 0.9.8w. As such, the OpenSSL library itself is reportedly affected by a memory corruption vulnerability via an integer truncation error in the function 'asn1_d2i_read_bio' when reading ASN.1 DER format data. Applications using the 'BIO' or 'FILE' based functions (i.e., 'd2i_*_bio' or 'd2i_*_fp' functions) are affected by this issue. Also affected are 'S/MIME' or 'CMS' applications using 'SMIME_read_PKCS7' or 'SMIME_read_CMS' parsers. The OpenSSL command line utility is affected if used to handle untrusted DER formatted data. Note that the SSL/TLS code of OpenSSL is not affected. Also not affected are applications using memory-based ASN.1 functions (e.g., 'd2i_X509', 'd2i_PKCS12', etc.) nor are applications using only PEM functions. Note also that the original fix for CVE-2012-2110 in 0.9.8v was incomplete because the functions 'BUF_MEM_grow' and 'BUF_MEM_grow_clean', in file 'openssl/crypto/buffer/buffer.c', did not properly account for negative values of the argument 'len'.",
        "describe_cn": "OpenSSL是一种开放源码的SSL实现，用来实现网络通信的高强度加密，现在被广泛地用于各种网络应用程序中。 （1）OpenSSL 0.9.8v之前版本，1.0.0i之前的1.0.0版本和1.0.1a之前的1.0.1版本中的asn1_d2i_read_bio函数中存在漏洞，该漏洞源于未正确解释整数数据。远程攻击者可利用该漏洞借助特制DER数据导致缓冲区溢出攻击，拒绝服务（内存破坏）或造成其他未明影响。此漏洞已被X.509证书或RSA公钥证实。 （2）OpenSSL 0.9.8v版本中的crypto/buffer/buffer.c中存在多个整数字符串错误漏洞。远程攻击者可利用这些漏洞借助特制DER数据导致缓冲区溢出攻击，造成拒绝服务（内存损坏）或可能有其他未明影响。该漏洞已被X.509证书或RSA公钥证实。",
        "solution_en": "Upgrade to OpenSSL 0.9.8w or later.",
        "solution_cn": "升级OpenSSL版本至0.9.8w及以上版本 相关链接： http://openssl.org/news/secadv_20120419.txt http://seclists.org/fulldisclosure/2012/Apr/210 http://openssl.org/news/secadv_20120424.txt http://cvs.openssl.org/chngview?cn=22479 http://www.openssl.org/news/changelog.html",
        "cve": "",
        "plugin_id": "58799"
    },
    "58966": {
        "name_en": "PHP < 5.3.11 Multiple Vulnerabilities",
        "name_cn": "PHP版本低于5.3.11导致多个漏洞",
        "risk_en": "Medium",
        "risk_cn": "中危",
        "describe_en": "According to its banner, the version of PHP installed on the remote host is earlier than 5.3.11, and as such is potentially affected by multiple vulnerabilities : - During the import of environment variables, temporary changes to the 'magic_quotes_gpc' directive are not handled properly. This can lower the difficulty for SQL injection attacks. (CVE-2012-0831) - The '$_FILES' variable can be corrupted because the names of uploaded files are not properly validated. (CVE-2012-1172) - The 'open_basedir' directive is not properly handled by the functions 'readline_write_history' and 'readline_read_history'. - The 'header()' function does not detect multi-line headers with a CR. (Bug #60227 / CVE-2011-1398)",
        "describe_cn": "Apache版本低，可能会受到多个漏洞影响。",
        "solution_en": "Upgrade to PHP version 5.3.11 or later.",
        "solution_cn": "升级PHP版本到5.3.11以上",
        "cve": "",
        "plugin_id": "58966"
    },
    "58987": {
        "name_en": "PHP Unsupported Version Detection",
        "name_cn": "当前PHP版本厂商已不支持",
        "risk_en": "Critical",
        "risk_cn": "紧急",
        "describe_en": "According to its version, the installation of PHP on the remote host is no longer supported. Lack of support implies that no new security patches for the product will be released by the vendor. As a result, it is likely to contain security vulnerabilities.",
        "describe_cn": "根据现有版本，远程主机安装的PHP版本不再被厂商支持，意味着不再发布相关的安全补丁包，结果可能存在多个安全漏洞。",
        "solution_en": "Upgrade to a version of PHP that is currently supported.",
        "solution_cn": "升级至当前的支持版本 http://php.net/eol.php https://wiki.php.net/rfc/releaseprocess",
        "cve": "",
        "plugin_id": "58987"
    },
    "58988": {
        "name_en": "PHP < 5.3.12 / 5.4.2 CGI Query String Code Execution",
        "name_cn": "PHP版本低于5.3.12 / 5.4.2导致CGI查询语句代码执行漏洞",
        "risk_en": "High",
        "risk_cn": "高危",
        "describe_en": "According to its banner, the version of PHP installed on the remote host is earlier than 5.3.12 / 5.4.2, and as such is potentially affected by a remote code execution and information disclosure vulnerability. An error in the file 'sapi/cgi/cgi_main.c' can allow a remote attacker to obtain PHP source code from the web server or to potentially execute arbitrary code. In vulnerable configurations, PHP treats certain query string parameters as command line arguments including switches such as '-s', '-d', and '-c'. Note that this vulnerability is exploitable only when PHP is used in CGI-based configurations. Apache with 'mod_php' is not an exploitable configuration.",
        "describe_cn": "PHP版本较低，可能导致CGI查询语句代码执行漏洞。",
        "solution_en": "Upgrade to PHP version 5.3.12 / 5.4.2 or later. A 'mod_rewrite' workaround is available as well.",
        "solution_cn": "升级PHP版本到5.4.2以上 http://httpd.apache.org/",
        "cve": "",
        "plugin_id": "58988"
    },
    "59076": {
        "name_en": "OpenSSL 0.9.8 < 0.9.8x DTLS CBC Denial of Service",
        "name_cn": "OpenSSL版本低于0.9.8x，DTLS CBC拒绝服务攻击漏洞",
        "risk_en": "Medium",
        "risk_cn": "中危",
        "describe_en": "According to its banner, the remote web server is running a version of OpenSSL 0.9.8 earlier than 0.9.8x. As such, the OpenSSL library itself is reportedly affected by a denial of service vulnerability. An integer underflow error exists in the file 'ssl/d1_enc.c' in the function 'dtls1_enc'. When in CBC mode, DTLS record length values and explicit initialization vector length values related to DTLS packets are not handled properly, which can lead to memory corruption and application crashes.",
        "describe_cn": "OpenSSL是一种开放源码的SSL实现，用来实现网络通信的高强度加密，现在被广泛地用于各种网络应用程序中。 OpenSSL 0.9.8x之前版本，1.0.0j之前的1.0.0版本以及1.0.1c之前的1.0.1版本中存在整数下溢漏洞，该漏洞源于TLS 1.1版本、TLS 1.2版本或者DTLS用于CBC加密。远程攻击者可利用该漏洞借助在某些明确IV计算过程中未正确处理的特制TLS数据包导致拒绝服务（缓冲区越界读取），或者产生其他未明影响。",
        "solution_en": "Upgrade to OpenSSL 0.9.8x or later.",
        "solution_cn": "升级OpenSSL版本至0.9.8x及以上版本 相关链接： http://openssl.org/news/secadv_20120510.txt http://www.openssl.org/news/changelog.html http://cvs.openssl.org/chngview?cn=22538 https://bugzilla.redhat.com/show_bug.cgi?id=820686",
        "cve": "",
        "plugin_id": "59076"
    },
    "62101": {
        "name_en": "Apache 2.2 < 2.2.23 Multiple Vulnerabilities",
        "name_cn": "Apache版本低于2.2.23",
        "risk_en": "Medium",
        "risk_cn": "中危",
        "describe_en": "According to its banner, the version of Apache 2.2.x running on the remote host is prior to 2.2.23. It is, therefore, potentially affected by the following vulnerabilities : - The utility 'apachectl' can receive a zero-length directory name in the LD_LIBRARY_PATH via the 'envvars' file. A local attacker with access to that utility could exploit this to load a malicious Dynamic Shared Object (DSO), leading to arbitrary code execution. (CVE-2012-0883) - An input validation error exists related to 'mod_negotiation', 'Multiviews' and untrusted uploads that can allow cross-site scripting attacks. (CVE-2012-2687) Note that Nessus has not tested for these flaws but has instead relied on the version in the server's banner.",
        "describe_cn": "Apache版本较低，导致存在多处漏洞。",
        "solution_en": "Upgrade to Apache version 2.2.23 or later.",
        "solution_cn": "升级apache版本到2.2.23以上 http://httpd.apache.org/",
        "cve": "",
        "plugin_id": "62101"
    },
    "64532": {
        "name_en": "OpenSSL < 0.9.8y Multiple Vulnerabilities",
        "name_cn": "OpenSSL版本低于0.9.8y，存在多个安全漏洞",
        "risk_en": "Low",
        "risk_cn": "低危",
        "describe_en": "According to its banner, the remote web server is running a version of OpenSSL prior to 0.9.8y. The OpenSSL library is, therefore, reportedly affected by the following vulnerabilities : - An error exists related to the handling of OCSP response verification that could allow denial of service attacks. (CVE-2013-0166) - An error exists related to the SSL/TLS/DTLS protocols, CBC mode encryption and response time. An attacker could obtain plaintext contents of encrypted traffic via timing attacks. (CVE-2013-0169)",
        "describe_cn": "主机OpenSSL版本低于0.9.8y,这使得主机存在多个安全漏洞。",
        "solution_en": "Upgrade to OpenSSL 0.9.8y or later.",
        "solution_cn": "升级OpenSSL版本至0.9.8y及以上版本，或者使用厂家发布的补丁包进行升级 相关链接： http://www.openssl.org/news/secadv_20130204.txt",
        "cve": "",
        "plugin_id": "64532"
    },
    "64912": {
        "name_en": "Apache 2.2 < 2.2.24 Multiple XSS Vulnerabilities",
        "name_cn": "Apache版本低于2.2.24导致多个XSS漏洞",
        "risk_en": "Medium",
        "risk_cn": "中危",
        "describe_en": "According to its banner, the version of Apache 2.2.x running on the remote host is prior to 2.2.24. It is, therefore, potentially affected by the following cross-site scripting vulnerabilities : - Errors exist related to the modules mod_info, mod_status, mod_imagemap, mod_ldap, and mod_proxy_ftp and unescaped hostnames and URIs that could allow cross- site scripting attacks. (CVE-2012-3499) - An error exists related to the mod_proxy_balancer module's manager interface that could allow cross-site scripting attacks. (CVE-2012-4558) Note that Nessus did not actually test for these issues, but instead has relied on the version in the server's banner.",
        "describe_cn": "Apache版本低于2.2.24导致多个XSS漏洞，主要为以下模块：mod_info, mod_status, mod_imagemap, mod_ldap, and mod_proxy_ftp",
        "solution_en": "Upgrade to Apache version 2.2.24 or later. Alternatively, ensure that the affected modules are not in use.",
        "solution_cn": "升级Apache版本至2.2.24及以上。",
        "cve": "",
        "plugin_id": "64912"
    },
    "68915": {
        "name_en": "Apache 2.2 < 2.2.25 Multiple Vulnerabilities",
        "name_cn": "Apache版本低于2.2.25",
        "risk_en": "Medium",
        "risk_cn": "中危",
        "describe_en": "According to its banner, the version of Apache 2.2.x running on the remote host is prior to 2.2.25. It is, therefore, potentially affected by the following vulnerabilities : - A flaw exists in the 'RewriteLog' function where it fails to sanitize escape sequences from being written to log files, making it potentially vulnerable to arbitrary command execution. (CVE-2013-1862) - A denial of service vulnerability exists relating to the 'mod_dav' module as it relates to MERGE requests. (CVE-2013-1896) Note that Nessus did not actually test for these issues, but instead has relied on the version in the server's banner.",
        "describe_cn": "Apache版本较低，导致存在多处漏洞。",
        "solution_en": "Upgrade to Apache version 2.2.25 or later. Alternatively, ensure that the affected modules are not in use.",
        "solution_cn": "升级apache版本到2.2.25以上 http://httpd.apache.org/",
        "cve": "",
        "plugin_id": "68915"
    },
    "73289": {
        "name_en": "PHP PHP_RSHUTDOWN_FUNCTION Security Bypass",
        "name_cn": "PHP_RSHUTDOWN_FUNCTION模块绕过漏洞",
        "risk_en": "Medium",
        "risk_cn": "中危",
        "describe_en": "According to its banner, the version of PHP 5.x installed on the remote host is 5.x prior to 5.3.11 or 5.4.x prior to 5.4.1 and thus, is potentially affected by a security bypass vulnerability. An error exists related to the function 'PHP_RSHUTDOWN_FUNCTION' in the libxml extension and the 'stream_close' method that could allow a remote attacker to bypass 'open_basedir' protections and obtain sensitive information. Note that this plugin has not attempted to exploit this issue, but has instead relied only on PHP's self-reported version number.",
        "describe_cn": "PHP 5.x版本中的‘libxml RSHUTDOWN’函数中存在信息泄露漏洞。远程攻击者可通过调用stream_close方法利用该漏洞绕过open_basedir保护机制，读取任意文件。",
        "solution_en": "Upgrade to PHP version 5.3.11 / 5.4.1 or later.",
        "solution_cn": "升级PHP版本至5.3.11 / 5.4.1及以上。",
        "cve": "",
        "plugin_id": "73289"
    },
    "73405": {
        "name_en": "Apache 2.2 < 2.2.27 Multiple Vulnerabilities",
        "name_cn": "Apache版本2.2 低于2.2.27 导致多个漏洞",
        "risk_en": "Medium",
        "risk_cn": "中危",
        "describe_en": "According to its banner, the version of Apache 2.2.x running on the remote host is a version prior to 2.2.27. It is, therefore, potentially affected by the following vulnerabilities : - A flaw exists with the 'mod_dav' module that is caused when tracking the length of CDATA that has leading white space. A remote attacker with a specially crafted DAV WRITE request can cause the service to stop responding. (CVE-2013-6438) - A flaw exists in 'mod_log_config' module that is caused when logging a cookie that has an unassigned value. A remote attacker with a specially crafted request can cause the service to crash. (CVE-2014-0098) Note that Nessus did not actually test for these issues, but instead has relied on the version in the server's banner.",
        "describe_cn": "Apache版本低，可能会受到多个漏洞影响。",
        "solution_en": "Upgrade to Apache version 2.2.27 or later. Alternatively, ensure that the affected modules are not in use.",
        "solution_cn": "升级apache版本到2.2.27以上 http://httpd.apache.org/",
        "cve": "",
        "plugin_id": "73405"
    },
    "74363": {
        "name_en": "OpenSSL 0.9.8 < 0.9.8za Multiple Vulnerabilities",
        "name_cn": "OpenSSL版本低于0.9.8za，存在多种安全漏洞",
        "risk_en": "Medium",
        "risk_cn": "中危",
        "describe_en": "According to its banner, the remote web server uses a version of OpenSSL 0.9.8 prior to 0.9.8za. The OpenSSL library is, therefore, reportedly affected by the following vulnerabilities : - An error exists related to the implementation of the Elliptic Curve Digital Signature Algorithm (ECDSA) that could allow nonce disclosure via the 'FLUSH+RELOAD' cache side-channel attack. (CVE-2014-0076) - A buffer overflow error exists related to invalid DTLS fragment handling that could lead to execution of arbitrary code. Note this issue only affects OpenSSL when used as a DTLS client or server. (CVE-2014-0195) - An error exists related to DTLS handshake handling that could lead to denial of service attacks. Note this issue only affects OpenSSL when used as a DTLS client. (CVE-2014-0221) - An unspecified error exists that could allow an attacker to cause usage of weak keying material leading to simplified man-in-the-middle attacks. (CVE-2014-0224) - An unspecified error exists related to anonymous ECDH ciphersuites that could allow denial of service attacks. Note this issue only affects OpenSSL TLS clients. (CVE-2014-3470)",
        "describe_cn": "主机OpenSSL版本低于0.9.8za,这使得主机存在多个安全漏洞。",
        "solution_en": "Upgrade to OpenSSL 0.9.8za or later.",
        "solution_cn": "升级OpenSSL版本至0.9.8za及以上版本。 相关链接： http://www.openssl.org/news/vulnerabilities.html#2014-0076 http://www.openssl.org/news/vulnerabilities.html#CVE-2014-0221 http://www.openssl.org/news/vulnerabilities.html#CVE-2014-0224 http://www.openssl.org/news/vulnerabilities.html#CVE-2014-3470 http://www.openssl.org/news/secadv_20140605.txt http://ccsinjection.lepidum.co.jp/ https://www.imperialviolet.org/2014/06/05/earlyccs.html",
        "cve": "",
        "plugin_id": "74363"
    },
    "77086": {
        "name_en": "OpenSSL 0.9.8 < 0.9.8zb Multiple Vulnerabilities",
        "name_cn": "OpenSSL版本低于0.9.8zb，存在多种安全漏洞",
        "risk_en": "Medium",
        "risk_cn": "中危",
        "describe_en": "According to its banner, the remote web server uses a version of OpenSSL 0.9.8 prior to 0.9.8zb. The OpenSSL library is, therefore, affected by the following vulnerabilities : - A memory double-free error exists related to handling DTLS packets that allows denial of service attacks. (CVE-2014-3505) - An unspecified error exists related to handling DTLS handshake messages that allows denial of service attacks due to large amounts of memory being consumed. (CVE-2014-3506) - A memory leak error exists related to handling specially crafted DTLS packets that allows denial of service attacks. (CVE-2014-3507) - An error exists related to 'OBJ_obj2txt' and the pretty printing 'X509_name_*' functions which leak stack data, resulting in an information disclosure. (CVE-2014-3508) - A NULL pointer dereference error exists related to handling anonymous ECDH cipher suites and crafted handshake messages that allow denial of service attacks against clients. (CVE-2014-3510)",
        "describe_cn": "主机OpenSSL版本低于0.9.8zb,这使得主机存在多个安全漏洞。",
        "solution_en": "Upgrade to OpenSSL 0.9.8zb or later.",
        "solution_cn": "升级OpenSSL版本至0.9.8zB及以上版本。 相关链接： https://www.openssl.org/news/openssl-0.9.8-notes.html https://www.openssl.org/news/secadv_20140806.txt https://www.openssl.org/news/vulnerabilities.html",
        "cve": "",
        "plugin_id": "77086"
    },
    "77531": {
        "name_en": "Apache 2.2 < 2.2.28 Multiple Vulnerabilities",
        "name_cn": "Apache版本2.2 低于2.2.28",
        "risk_en": "Medium",
        "risk_cn": "中危",
        "describe_en": "According to its banner, the version of Apache 2.2.x running on the remote host is prior to 2.2.28. It is, therefore, affected by the following vulnerabilities : - A flaw exists within the 'mod_headers' module which allows a remote attacker to inject arbitrary headers. This is done by placing a header in the trailer portion of data being sent using chunked transfer encoding. (CVE-2013-5704) - A flaw exists within the 'mod_deflate' module when handling highly compressed bodies. Using a specially crafted request, a remote attacker can exploit this to cause a denial of service by exhausting memory and CPU resources. (CVE-2014-0118) - The 'mod_status' module contains a race condition that can be triggered when handling the scoreboard. A remote attacker can exploit this to cause a denial of service, execute arbitrary code, or obtain sensitive credential information. (CVE-2014-0226) - The 'mod_cgid' module lacks a time out mechanism. Using a specially crafted request, a remote attacker can use this flaw to cause a denial of service by causing child processes to linger indefinitely, eventually filling up the scoreboard. (CVE-2014-0231) Note that Nessus has not tested for these issues but has instead relied only on the application's self-reported version number.",
        "describe_cn": "Apache版本较低，导致存在多处漏洞。",
        "solution_en": "Upgrade to Apache version 2.2.29 or later. Note that version 2.2.28 was never officially released.",
        "solution_cn": "升级apache版本到2.2.28以上 http://httpd.apache.org/",
        "cve": "",
        "plugin_id": "77531"
    },
    "78552": {
        "name_en": "OpenSSL 0.9.8 < 0.9.8zc Multiple Vulnerabilities (POODLE)",
        "name_cn": "OpenSSL版本低于0.9.8zc，存在多种安全漏洞",
        "risk_en": "Medium",
        "risk_cn": "中危",
        "describe_en": "According to its banner, the remote web server uses a version of OpenSSL 0.9.8 prior to 0.9.8zc. The OpenSSL library is, therefore, affected by the following vulnerabilities : - An error exists related to the way SSL 3.0 handles padding bytes when decrypting messages encrypted using block ciphers in cipher block chaining (CBC) mode. A man-in-the-middle attacker can decrypt a selected byte of a cipher text in as few as 256 tries if they are able to force a victim application to repeatedly send the same data over newly created SSL 3.0 connections. This is also known as the 'POODLE' issue. (CVE-2014-3566) - An error exists related to session ticket handling that can allow denial of service attacks via memory leaks. (CVE-2014-3567) - An error exists related to the build configuration process and the 'no-ssl3' build option that allows servers and clients to process insecure SSL 3.0 handshake messages. (CVE-2014-3568)",
        "describe_cn": "主机OpenSSL版本低于0.9.8zc,这使得主机存在多个安全漏洞。",
        "solution_en": "Upgrade to OpenSSL 0.9.8zc or later.",
        "solution_cn": "升级OpenSSL版本至0.9.8zc及以上版本。 相关链接： https://www.openssl.org/news/openssl-0.9.8-notes.html https://www.openssl.org/news/secadv_20141015.txt https://www.openssl.org/news/vulnerabilities.html https://www.imperialviolet.org/2014/10/14/poodle.html https://www.openssl.org/~bodo/ssl-poodle.pdf https://tools.ietf.org/html/draft-ietf-tls-downgrade-scsv-00",
        "cve": "",
        "plugin_id": "78552"
    },
    "78555": {
        "name_en": "OpenSSL Unsupported",
        "name_cn": "OpenSSL版本已不再支持",
        "risk_en": "Critical",
        "risk_cn": "紧急",
        "describe_en": "According to its banner, the remote web server is running a version of OpenSSL that is no longer supported. Lack of support implies that no new security patches for the product will be released by the vendor. As a result, it is likely to contain security vulnerabilities.",
        "describe_cn": "当前主机的OpenSSL版本已不再受厂商支持，这意味着厂商不再为当前版本发布安全补丁包，即可能存在安全漏洞",
        "solution_en": "Upgrade to a version of OpenSSL that is currently supported.",
        "solution_cn": "升级版本至厂商支持的版本 相关链接： https://www.openssl.org/news/openssl-old-notes.html",
        "cve": "",
        "plugin_id": "78555"
    },
    "80566": {
        "name_en": "OpenSSL 0.9.8 < 0.9.8zd Multiple Vulnerabilities",
        "name_cn": "OpenSSL版本低于0.9.8zd，存在多个安全漏洞",
        "risk_en": "Medium",
        "risk_cn": "中危",
        "describe_en": "According to its banner, the remote web server uses a version of OpenSSL 0.9.8 prior to 0.9.8zd. The OpenSSL library is, therefore, affected by the following vulnerabilities : - A NULL pointer dereference flaw exists when the SSLv3 option isn't enabled and an SSLv3 ClientHello is received. This allows a remote attacker, using an unexpected handshake, to crash the daemon, resulting in a denial of service. (CVE-2014-3569) - The BIGNUM squaring (BN_sqr) implementation does not properly calculate the square of a BIGNUM value. This allows remote attackers to defeat cryptographic protection mechanisms. (CVE-2014-3570) - A NULL pointer dereference flaw exists with dtls1_get_record() when handling DTLS messages. A remote attacker, using a specially crafted DTLS message, can cause a denial of service. (CVE-2014-3571) - A flaw exists with ECDH handshakes when using an ECDSA certificate without a ServerKeyExchange message. This allows a remote attacker to trigger a loss of forward secrecy from the ciphersuite. (CVE-2014-3572) - A flaw exists when accepting non-DER variations of certificate signature algorithms and signature encodings due to a lack of enforcement of matches between signed and unsigned portions. A remote attacker, by including crafted data within a certificate's unsigned portion, can bypass fingerprint-based certificate-blacklist protection mechanisms. (CVE-2014-8275) - A security feature bypass vulnerability, known as FREAK (Factoring attack on RSA-EXPORT Keys), exists due to the support of weak EXPORT_RSA cipher suites with keys less than or equal to 512 bits. A man-in-the-middle attacker may be able to downgrade the SSL/TLS connection to use EXPORT_RSA cipher suites which can be factored in a short amount of time, allowing the attacker to intercept and decrypt the traffic. (CVE-2015-0204)",
        "describe_cn": "OpenSSL版本低于0.9.8zd，存在多个安全漏洞。",
        "solution_en": "Upgrade to OpenSSL 0.9.8zd or later.",
        "solution_cn": "升级OpenSSL版本至0.9.8zd 及以上。 相关链接： https://www.openssl.org/news/openssl-0.9.8-notes.html https://www.openssl.org/news/secadv_20150108.txt https://www.openssl.org/news/vulnerabilities.html https://www.smacktls.com/#freak",
        "cve": "",
        "plugin_id": "80566"
    },
    "81576": {
        "name_en": "Jetty HttpParser Error Remote Memory Disclosure",
        "name_cn": "Jetty HttpParser错误远程内存泄漏",
        "risk_en": "Medium",
        "risk_cn": "中危",
        "describe_en": "The remote instance of Jetty is affected by a remote memory disclosure vulnerability in the HttpParser module due to incorrect handling of illegal characters in header values. When an illegal character is encountered in an HTTP request, Jetty writes a response in a shared buffer that was used in a previous request. Jetty's response to the client includes this shared buffer which contains potentially sensitive data from the previous request. An attacker, using specially crafted requests containing variable length strings of illegal characters, can steal sensitive header data (e.g. cookies, authentication tokens) or sensitive POST data (e.g. credentials).",
        "describe_cn": "Jetty的远程实例受到HttpParser模块中远程内存泄漏漏洞的影响，该漏洞是由于头值中非法字符的处理不正确造成的。当HTTP请求中遇到非法字符时，Jetty会在前一个请求中使用的共享缓冲区中写入响应。Jetty对客户机的响应包括这个共享缓冲区，其中包含来自上一个请求的潜在敏感数据。攻击者使用包含可变长度非法字符字符串的巧尽心思构建的请求，可以窃取敏感的头数据（例如cookie、身份验证令牌）或敏感的POST数据（例如凭据）。",
        "solution_en": "Upgrade to Jetty 9.2.9.v20150224 or later. For Jetty 9.3.x, contact the vendor for a solution.",
        "solution_cn": "升级至Jetty 9.2.9.v20150224或更高版本。对于Jetty 9.3.x，请联系供应商寻求解决方案。",
        "cve": "CVE-2015-2080"
    },
    "81606": {
        "name_en": "SSL/TLS EXPORT_RSA <= 512-bit Cipher Suites Supported (FREAK)",
        "name_cn": "SSL/TLS EXPORT_RSA密钥算法位数小于或等于512位",
        "risk_en": "Medium",
        "risk_cn": "中危",
        "describe_en": "The remote host supports EXPORT_RSA cipher suites with keys less than or equal to 512 bits. An attacker can factor a 512-bit RSA modulus in a short amount of time. A man-in-the middle attacker may be able to downgrade the session to use EXPORT_RSA cipher suites (e.g. CVE-2015-0204). Thus, it is recommended to remove support for weak cipher suites.",
        "describe_cn": "远程主机运行着弱密钥算法，攻击者可以在短时间内破解密文。",
        "solution_en": "Reconfigure the service to remove support for EXPORT_RSA cipher suites.",
        "solution_cn": "重新设置服务，或移除支持EXPORT_RSA的密钥层。 相关链接： https://www.smacktls.com/#freak https://www.openssl.org/news/secadv_20150108.txt http://www.nessus.org/u?b78da2c4",
        "cve": "",
        "plugin_id": "81606"
    },
    "82030": {
        "name_en": "OpenSSL 0.9.8 < 0.9.8zf Multiple Vulnerabilities",
        "name_cn": "OpenSSL版本低于0.9.9zf，存在多个安全漏洞",
        "risk_en": "Medium",
        "risk_cn": "中危",
        "describe_en": "According to its banner, the remote web server uses a version of OpenSSL 0.9.8 prior to 0.9.8zf. The OpenSSL library is, therefore, affected by the following vulnerabilities : - A use-after-free condition exists in the d2i_ECPrivateKey() function due to improper processing of malformed EC private key files during import. A remote attacker can exploit this to dereference or free already freed memory, resulting in a denial of service or other unspecified impact. (CVE-2015-0209) - An invalid read flaw exists in the ASN1_TYPE_cmp() function due to improperly performed boolean-type comparisons. A remote attacker can exploit this, via a crafted X.509 certificate to an endpoint that uses the certificate-verification feature, to cause an invalid read operation, resulting in a denial of service. (CVE-2015-0286) - A flaw exists in the ASN1_item_ex_d2i() function due to a failure to reinitialize 'CHOICE' and 'ADB' data structures when reusing a structure in ASN.1 parsing. This allows a remote attacker to cause an invalid write operation and memory corruption, resulting in a denial of service. (CVE-2015-0287) - A NULL pointer dereference flaw exists in the X509_to_X509_REQ() function due to improper processing of certificate keys. This allows a remote attacker, via a crafted X.509 certificate, to cause a denial of service. (CVE-2015-0288) - A NULL pointer dereference flaw exists in the PKCS#7 parsing code due to incorrect handling of missing outer ContentInfo. This allows a remote attacker, using an application that processes arbitrary PKCS#7 data and providing malformed data with ASN.1 encoding, to cause a denial of service. (CVE-2015-0289) - A flaw exists in servers that both support SSLv2 and enable export cipher suites due to improper implementation of SSLv2. A remote attacker can exploit this, via a crafted CLIENT-MASTER-KEY message, to cause a denial of service. (CVE-2015-0293) - A key disclosure vulnerability exists in the SSLv2 implementation in the get_client_master_key() function due to the acceptance of a nonzero CLIENT-MASTER-KEY CLEAR-KEY-LENGTH value for an arbitrary cipher. A man-in-the-middle attacker can exploit this to determine the MASTER-KEY value and decrypt TLS ciphertext data by leveraging a Bleichenbacher RSA padding oracle. (CVE-2016-0703) - An information disclosure vulnerability exists in the SSLv2 implementation in the get_client_master_key() function due to incorrectly overwriting MASTER-KEY bytes during use of export cipher suites. A remote attacker can exploit this to create a Bleichenbacher oracle. (CVE-2016-0704)",
        "describe_cn": "OpenSSL版本低于0.9.9zf，存在多个安全漏洞",
        "solution_en": "Upgrade to OpenSSL 0.9.8zf or later.",
        "solution_cn": "升级OpenSSL版本至0.9.8zf及以上。 相关链接： https://www.openssl.org/news/secadv_20150319.txt",
        "cve": "",
        "plugin_id": "82030"
    },
    "83738": {
        "name_en": "SSL/TLS EXPORT_DHE <= 512-bit Export Cipher Suites Supported (Logjam)",
        "name_cn": "SSL/TLS EXPORT_DHE密钥算法位数小于或等于512位",
        "risk_en": "Low",
        "risk_cn": "低危",
        "describe_en": "The remote host supports EXPORT_DHE cipher suites with keys less than or equal to 512 bits. Through cryptanalysis, a third party can find the shared secret in a short amount of time. A man-in-the middle attacker may be able to downgrade the session to use EXPORT_DHE cipher suites. Thus, it is recommended to remove support for weak cipher suites.",
        "describe_cn": "远程主机运行的EXPORT_DHE密钥算法小于或等于512位，通过密文分析，第三方攻击者可以在短时间内获取共享密钥。",
        "solution_en": "Reconfigure the service to remove support for EXPORT_DHE cipher suites.",
        "solution_cn": "重新设置服务，或移除支持EXPORT_DHE的密钥层。 相关链接： https://weakdh.org/",
        "cve": "",
        "plugin_id": "83738"
    },
    "84151": {
        "name_en": "OpenSSL 0.9.8 < 0.9.8zg Multiple Vulnerabilities",
        "name_cn": "OpenSSL BN_GF2m_mod_inv函数拒绝服务漏洞",
        "risk_en": "Medium",
        "risk_cn": "中危",
        "describe_en": "According to its banner, the remote web server uses a version of OpenSSL 0.9.8 prior to 0.9.8zg. The OpenSSL library is, therefore, affected by the following vulnerabilities : - A denial of service vulnerability exists when processing an ECParameters structure due to an infinite loop that occurs when a specified curve is over a malformed binary polynomial field. A remote attacker can exploit this to perform a denial of service against any system that processes public keys, certificate requests, or certificates. This includes TLS clients and TLS servers with client authentication enabled. (CVE-2015-1788) - A denial of service vulnerability exists due to improper validation of the content and length of the ASN1_TIME string by the X509_cmp_time() function. A remote attacker can exploit this, via a malformed certificate and CRLs of various sizes, to cause a segmentation fault, resulting in a denial of service condition. TLS clients that verify CRLs are affected. TLS clients and servers with client authentication enabled may be affected if they use custom verification callbacks. (CVE-2015-1789) - A NULL pointer dereference flaw exists in the PKCS#7 parsing code due to incorrect handling of missing inner 'EncryptedContent'. This allows a remote attacker, via specially crafted ASN.1-encoded PKCS#7 blobs with missing content, to cause a denial of service condition or other potential unspecified impacts. (CVE-2015-1790) - A double-free error exists due to a race condition that occurs when a NewSessionTicket is received by a multi-threaded client when attempting to reuse a previous ticket. (CVE-2015-1791) - A denial of service vulnerability exists in the CMS code due to an infinite loop that occurs when verifying a signedData message. A remote attacker can exploit this to cause a denial of service condition. (CVE-2015-1792)",
        "describe_cn": "OpenSSL是一种开放源码的SSL实现，用来实现网络通信的高强度加密，现在被广泛地用于各种网络应用程序中。OpenSSL 0.9.8s、1.0.0e、1.0.1n、1.0.2b之前版本，crypto/bn/bn_gf2m.c内的函数BN_GF2m_mod_inv没有正确处理ECParameters结构，远程攻击者通过使用Elliptic Curve算法的会话，利用此漏洞可造成拒绝服务(无限循环）。",
        "solution_en": "Upgrade to OpenSSL 0.9.8gz or later.",
        "solution_cn": "OpenSSL Project已经为此发布了一个安全公告（secadv_20150611）以及相应补丁: secadv_20150611：OpenSSL Security Advisory [11 Jun 2015] 链接：https://www.openssl.org/news/secadv_20150611.txt",
        "cve": "",
        "plugin_id": "84151"
    },
    "87219": {
        "name_en": "OpenSSL 0.9.8 < 0.9.8zh X509_ATTRIBUTE Memory Leak DoS",
        "name_cn": "OpenSSL 0.9.8 <0.9.8zh X509_ATTRIBUTE内存泄漏DoS",
        "risk_en": "Medium",
        "risk_cn": "中危",
        "describe_en": "According to its banner, the remote host is running a version of OpenSSL 0.9.8 prior to 0.9.8zh. It is, therefore, affected by a flaw in the ASN1_TFLG_COMBINE implementation in file tasn_dec.c related to handling malformed X509_ATTRIBUTE structures. A remote attacker can exploit this to cause a memory leak by triggering a decoding failure in a PKCS#7 or CMS application, resulting in a denial of service.",
        "describe_cn": "根据其banner判断，远程主机正在运行一个0.9.8zh版本之前的OpenSSL 0.9.8。 此版本受到与处理格式错误的X509_ATTRIBUTE结构相关的文件tasn_dec.c中的ASN1_TFLG_COMBINE实现中的缺陷的影响。 远程攻击者可以通过触发解码失败来利用这个漏洞在PKCS＃7或CMS应用程序中引起内存泄漏，导致拒绝服务。",
        "solution_en": "Upgrade to OpenSSL version 0.9.8zh or later.",
        "solution_cn": "升级到OpenSSL 0.9.8zh或更高版本。",
        "cve": "",
        "plugin_id": "87219"
    },
    "89058": {
        "name_en": "SSL DROWN Attack Vulnerability (Decrypting RSA with Obsolete and Weakened eNcryption)",
        "name_cn": "SSL DROWN攻击漏洞（解密RSA（使用过时的弱加密算法））",
        "risk_en": "Medium",
        "risk_cn": "中危",
        "describe_en": "The remote host supports SSLv2 and therefore may be affected by a vulnerability that allows a cross-protocol Bleichenbacher padding oracle attack known as DROWN (Decrypting RSA with Obsolete and Weakened eNcryption). This vulnerability exists due to a flaw in the Secure Sockets Layer Version 2 (SSLv2) implementation, and it allows captured TLS traffic to be decrypted. A man-in-the-middle attacker can exploit this to decrypt the TLS connection by utilizing previously captured traffic and weak cryptography along with a series of specially crafted connections to an SSLv2 server that uses the same private key.",
        "describe_cn": "远程主机受到此漏洞影响，可允许远程攻击者试图解密捕获的TLS流量。 SSLv2协议中存在一个填充内容缺陷，攻击者可以利用这个缺陷解密使用新版SSL/TLS协议会话中由RSA算法加密的内容。通过这种利用方式，可造成DROWN攻击。 受影响的版本：Apache(非2.4.X版本)、Nginx(0.7.64、0.8.18及更早版本)、Postfix（早于2.9.14、2.10.8、2.11.6、3.0.2的版本 (在2015.07.20之前发布)）、Openssl: 1.0.2a、1.0.1m、1.0.0r、0.9.8zf及更早版本。",
        "solution_en": "Disable SSLv2 and export grade cryptography cipher suites. Ensure that private keys are not used anywhere with server software that supports SSLv2 connections.",
        "solution_cn": "1、升级OpenSSL软件包： （1）.CentOS、Redhat 可以通过以下命令来升级 #yum clean #yum update openssl 对应的RPM包： CentOS 5: openssl-0.9.8e-39.el5_11、openssl-devel-0.9.8e-39.el5_11、 openssl-perl-0.9.8e-39.el5_11 CentOS 6:openssl-1.0.1e-42.el6_7.4、openssl-devel-1.0.1e-42.el6_7.4、openssl-perl-1.0.1e-42.el6_7.4、 openssl-static-1.0.1e-42.el6_7.4 CentOS 7:openssl-1.0.1e-51.el7_2.4、openssl-devel-1.0.1e-51.el7_2.4、openssl-libs-1.0.1e-51.el7_2.4、openssl-perl-1.0.1e-51.el7_2.4、openssl-static-1.0.1e-51.el7_2.4 (2). ubuntu 版本可以通过以下命令来升级 #apt-get upgrade openssl 2、禁用 Apache、Nginx、Postfix 中的SSLv2 在Apache 的 SSL 配置文件中禁用SSLv2 SSLProtocol all -SSLv2 重启apache服务 在 Nginx 的 SSL 配置文件中设置只允许使用 TLS 协议： ssl_protocols TLSv1 TLSv1.1 TLSv1.2; 重启nginx服务 在Postfix配置中禁用SSLv2 # Minimal recommended settings. Whenever the built-in defaults are # sufficient, let the built-in defaults stand by deleting any explicit # overrides. The default mandatory TLS protocols have never included # SSLv2, check to make sure you have not inadvertently enabled it. smtpd_tls_protocols = !SSLv2, !SSLv3 smtpd_tls_mandatory_protocols = !SSLv2, !SSLv3 tlsproxy_tls_protocols = $smtpd_tls_protocols tlsproxy_tls_mandatory_protocols = $smtpd_tls_mandatory_protocols smtp_tls_protocols = !SSLv2, !SSLv3 smtp_tls_mandatory_protocols = !SSLv2, !SSLv3 lmtp_tls_protocols = !SSLv2, !SSLv3 lmtp_tls_mandatory_protocols = !SSLv2, !SSLv3 smtpd_tls_ciphers = medium smtp_tls_ciphers = medium # Other best practices # Strongly recommended: # http://www.postfix.org/FORWARD_SECRECY_README.html#server_fs smtpd_tls_dh1024_param_file=${config_directory}/dh2048.pem smtpd_tls_eecdh_grade = strong # Suggested, not strictly needed: smtpd_tls_exclude_ciphers = EXPORT, LOW, MD5, SEED, IDEA, RC2 smtp_tls_exclude_ciphers = EXPORT, LOW, MD5, aDSS, kECDHe, kECDHr, kDHd, kDHr, SEED, IDEA, RC2",
        "cve": "",
        "plugin_id": "89058"
    },
    "100995": {
        "name_en": "Apache 2.2.x < 2.2.33-dev / 2.4.x < 2.4.26 Multiple Vulnerabilities",
        "name_cn": "Apache 2.2.x < 2.2.33-dev / 2.4.x < 2.4.26 多个漏洞",
        "risk_en": "High",
        "risk_cn": "高危",
        "describe_en": "According to its banner, the version of Apache running on the remote host is 2.2.x prior to 2.2.33-dev or 2.4.x prior to 2.4.26. It is, therefore, affected by the following vulnerabilities : - An authentication bypass vulnerability exists due to third-party modules using the ap_get_basic_auth_pw() function outside of the authentication phase. An unauthenticated, remote attacker can exploit this to bypass authentication requirements. (CVE-2017-3167) - A NULL pointer dereference flaw exists due to third-party module calls to the mod_ssl ap_hook_process_connection() function during an HTTP request to an HTTPS port. An unauthenticated, remote attacker can exploit this to cause a denial of service condition. (CVE-2017-3169) - A NULL pointer dereference flaw exists in mod_http2 that is triggered when handling a specially crafted HTTP/2 request. An unauthenticated, remote attacker can exploit this to cause a denial of service condition. Note that this vulnerability does not affect 2.2.x. (CVE-2017-7659) - An out-of-bounds read error exists in the ap_find_token() function due to improper handling of header sequences. An unauthenticated, remote attacker can exploit this, via a specially crafted header sequence, to cause a denial of service condition. (CVE-2017-7668) - An out-of-bounds read error exists in mod_mime due to improper handling of Content-Type response headers. An unauthenticated, remote attacker can exploit this, via a specially crafted Content-Type response header, to cause a denial of service condition or the disclosure of sensitive information. (CVE-2017-7679) Note that Nessus has not tested for these issues but has instead relied only on the application's self-reported version number.",
        "describe_cn": "此版本受到以下漏洞影响： - httpd中存在身份验证绕过漏洞 由于第三方模块使用 ap_get_basic_auth_pw（）函数之外 验证阶段。远程攻击者可以利用此来绕过身份验证 要求。 （CVE-2017-3167） - httpd由于存在拒绝服务漏洞 一个NULL指针解除引用的缺陷，当 第三方模块调用mod_ssl 一个HTTP期间的ap_hook_process_connection（）函数 请求HTTPS端口。远程攻击者可以利用这一点导致拒绝服务 条件。 （CVE-2017-3169） - httpd由于存在拒绝服务漏洞 ap_find_token（）中的out-of-bounds读取错误 在特殊处理时触发的功能 制作的请求头序列。 远程攻击者可以利用这个来破坏它 服务或强制ap_find_token（）返回一个不正确的 值。 （CVE-2017-7668） - httpd由于存在拒绝服务漏洞 mod_mime中出现超出范围的读取错误 在处理特制Content-Type时触发 响应头。远程攻击者可以 利用这一点来披露敏感信息或原因 拒绝服务条件。 （CVE-2017-7679） - httpd由于存在拒绝服务漏洞 无法初始化或重置值占位符 在[代理 - ]授权标题类型'Digest'之前 或在连续的键=值分配之间 mod_auth_digest的。远程攻击者可以 利用这个，通过提供没有'='的初始密钥 转让，披露敏感信息或导致 拒绝服务条件。 （CVE-2017-9788）",
        "solution_en": "Upgrade to Apache version 2.2.33-dev / 2.4.26 or later.",
        "solution_cn": "升级Apache版本至2.2.33-dev / 2.4.26或之后的版本",
        "cve": "",
        "plugin_id": "100995"
    },
    "101787": {
        "name_en": "Apache 2.2.x < 2.2.34 Multiple Vulnerabilities",
        "name_cn": "Apache 2.2.x < 2.2.34 多个漏洞",
        "risk_en": "High",
        "risk_cn": "高危",
        "describe_en": "According to its banner, the version of Apache running on the remote host is 2.2.x prior to 2.2.34. It is, therefore, affected by the following vulnerabilities : - An authentication bypass vulnerability exists in httpd due to third-party modules using the ap_get_basic_auth_pw() function outside of the authentication phase. An unauthenticated, remote attacker can exploit this to bypass authentication requirements. (CVE-2017-3167) - A denial of service vulnerability exists in httpd due to a NULL pointer dereference flaw that is triggered when a third-party module calls the mod_ssl ap_hook_process_connection() function during an HTTP request to an HTTPS port. An unauthenticated, remote attacker can exploit this to cause a denial of service condition. (CVE-2017-3169) - A denial of service vulnerability exists in httpd due to an out-of-bounds read error in the ap_find_token() function that is triggered when handling a specially crafted request header sequence. An unauthenticated, remote attacker can exploit this to crash the service or force ap_find_token() to return an incorrect value. (CVE-2017-7668) - A denial of service vulnerability exists in httpd due to an out-of-bounds read error in the mod_mime that is triggered when handling a specially crafted Content-Type response header. An unauthenticated, remote attacker can exploit this to disclose sensitive information or cause a denial of service condition. (CVE-2017-7679) - A denial of service vulnerability exists in httpd due to a failure to initialize or reset the value placeholder in [Proxy-]Authorization headers of type 'Digest' before or between successive key=value assignments by mod_auth_digest. An unauthenticated, remote attacker can exploit this, by providing an initial key with no '=' assignment, to disclose sensitive information or cause a denial of service condition. (CVE-2017-9788) Note that Nessus has not tested for these issues but has instead relied only on the application's self-reported version number.",
        "describe_cn": "此版本受到以下漏洞的影响： - 由于存在身份验证绕过漏洞 第三方模块使用ap_get_basic_auth_pw（） 功能在认证阶段之外。远程攻击者可以利用这一点 旁路认证要求。 （CVE-2017-3167） - 由于存在NULL指针解除引用缺陷 第三方模块调用mod_ssl 一个HTTP期间的ap_hook_process_connection（）函数 请求HTTPS端口。远程攻击者可以利用这一点导致拒绝服务 条件。 （CVE-2017-3169） - mod_http2中存在NULL指针解引用缺陷 在处理特制HTTP / 2时被触发 请求。远程攻击者可以利用这导致拒绝服务条件。注意 此漏洞不影响2.2.x. （CVE-2017-7659） - 存在超出范围的读取错误 ap_find_token（）函数由于处理不当而导致 标题序列。远程攻击者可以通过一个特制的标题来利用这个 导致拒绝服务条件。 （CVE-2017-7668） - 由于mod_mime，存在超出限制的读取错误 Content-Type响应标头的不当处理。远程攻击者可以通过a进行利用 特制的Content-Type响应头，引起拒绝服务条件或披露 敏感信息。 （CVE-2017-7679）",
        "solution_en": "Upgrade to Apache version 2.2.34 or later.",
        "solution_cn": "2.2.34升级Apache版本至2.2.34或之后的版本",
        "cve": "",
        "plugin_id": "101787"
    },
    "108797": {
        "name_en": "Unsupported Windows OS (remote)",
        "name_cn": "低版本的Windows系统",
        "risk_en": "Critical",
        "risk_cn": "紧急",
        "describe_en": "The remote version of Microsoft Windows is either missing a service pack or is no longer supported. As a result, it is likely to contain security vulnerabilities.",
        "describe_cn": "低版本的Windows系统",
        "solution_en": "Upgrade to a supported service pack or operating system",
        "solution_cn": "升级操作系统",
        "cve": "",
        "plugin_id": "108797"
    },
    "142591": {
        "name_en": "PHP < 7.3.24 Multiple Vulnerabilities",
        "name_cn": "PHP<7.3.24多个漏洞",
        "risk_en": "Medium",
        "risk_cn": "中危",
        "describe_en": "According to its self-reported version number, the version of PHP running on the remote web server is prior to 7.3.24. It is, therefore affected by multiple vulnerabilities",
        "describe_cn": "根据其自报的版本号，在远程web服务器上运行的PHP版本早于7.3.24。因此，它受到多个漏洞的影响",
        "solution_en": "Upgrade to PHP version 7.3.24 or later.",
        "solution_cn": "升级至PHP版本7.3.24或更高版本。",
        "cve": "",
        "plugin_id": "142591"
    }
}