{
    "73756": {
        "name_en": "Microsoft SQL Server Unsupported Version Detection (remote check)",
        "name_cn": "Microsoft SQL Server不支持的版本检测（远程检查）",
        "risk_en": "Critical",
        "risk_cn": "紧急",
        "describe_en": "According to its self-reported version number, the installation of Microsoft SQL Server on the remote host is no longer supported. Lack of support implies that no new security patches for the product will be released by the vendor. As a result, it is likely to contain security vulnerabilities.",
        "describe_cn": "根据其自我报告的版本号，不再支持在远程主机上安装Microsoft SQL Server。缺少支持意味着供应商不会发布产品的新安全修补程序。因此，它很可能包含安全漏洞。",
        "solution_en": "Upgrade to a version of Microsoft SQL Server that is currently supported.",
        "solution_cn": "升级到当前支持的Microsoft SQL Server版本。",
        "cve": ""
    },
    "17764": {
        "name_en": "OpenSSL < 0.9.8k Signature Repudiation",
        "name_cn": "OpenSSL<0.9.8k签名否认",
        "risk_en": "Low",
        "risk_cn": "低危",
        "describe_en": "According to its banner, the remote server is running a version of OpenSSL that is earlier than 0.9.8k. As such, it may allow a valid sign to generate invalid signatures which would appear valid and could be repudiated later. This only affects CMS users. CMS appeared in OpenSSL 0.9.8h.",
        "describe_cn": "根据它的横幅，远程服务器运行的是早于0.9.8k的OpenSSL版本。因此，它可以允许有效的签名生成无效的签名，这些签名看起来是有效的，并且可以在以后被拒绝。这只影响CMS用户。CMS出现在openssl0.9.8h中。",
        "solution_en": "Upgrade to OpenSSL 0.9.8k or later.",
        "solution_cn": "升级至OpenSSL 0.9.8k或更高版本。",
        "cve": "CVE-2009-0591"
    },
    "81576": {
        "name_en": "Jetty HttpParser Error Remote Memory Disclosure",
        "name_cn": "Jetty HttpParser错误远程内存泄漏",
        "risk_en": "Medium",
        "risk_cn": "中危",
        "describe_en": "The remote instance of Jetty is affected by a remote memory disclosure vulnerability in the HttpParser module due to incorrect handling of illegal characters in header values. When an illegal character is encountered in an HTTP request, Jetty writes a response in a shared buffer that was used in a previous request. Jetty's response to the client includes this shared buffer which contains potentially sensitive data from the previous request. An attacker, using specially crafted requests containing variable length strings of illegal characters, can steal sensitive header data (e.g. cookies, authentication tokens) or sensitive POST data (e.g. credentials).",
        "describe_cn": "Jetty的远程实例受到HttpParser模块中远程内存泄漏漏洞的影响，该漏洞是由于头值中非法字符的处理不正确造成的。当HTTP请求中遇到非法字符时，Jetty会在前一个请求中使用的共享缓冲区中写入响应。Jetty对客户机的响应包括这个共享缓冲区，其中包含来自上一个请求的潜在敏感数据。攻击者使用包含可变长度非法字符字符串的巧尽心思构建的请求，可以窃取敏感的头数据（例如cookie、身份验证令牌）或敏感的POST数据（例如凭据）。",
        "solution_en": "Upgrade to Jetty 9.2.9.v20150224 or later. For Jetty 9.3.x, contact the vendor for a solution.",
        "solution_cn": "升级至Jetty 9.2.9.v20150224或更高版本。对于Jetty 9.3.x，请联系供应商寻求解决方案。",
        "cve": "CVE-2015-2080"
    }
}